Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/gmac.h
/*
 * Component description for GMAC
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-10-04T10:37:14Z */
#ifndef _SAMA5D_GMAC_COMPONENT_H_
#define _SAMA5D_GMAC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR GMAC                                         */
/* ************************************************************************** */

/* -------- GMAC_SAB : (GMAC Offset: 0x00) (R/W 32) Specific Address 1 Bottom Register -------- */
#define GMAC_SAB_ADDR_Pos                     _UINT32_(0)                                          /* (GMAC_SAB) Specific Address 1 Position */
#define GMAC_SAB_ADDR_Msk                     (_UINT32_(0xFFFFFFFF) << GMAC_SAB_ADDR_Pos)          /* (GMAC_SAB) Specific Address 1 Mask */
#define GMAC_SAB_ADDR(value)                  (GMAC_SAB_ADDR_Msk & (_UINT32_(value) << GMAC_SAB_ADDR_Pos)) /* Assigment of value for ADDR in the GMAC_SAB register */
#define GMAC_SAB_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (GMAC_SAB) Register Mask  */


/* -------- GMAC_SAT : (GMAC Offset: 0x04) (R/W 32) Specific Address 1 Top Register -------- */
#define GMAC_SAT_ADDR_Pos                     _UINT32_(0)                                          /* (GMAC_SAT) Specific Address 2 Position */
#define GMAC_SAT_ADDR_Msk                     (_UINT32_(0xFFFF) << GMAC_SAT_ADDR_Pos)              /* (GMAC_SAT) Specific Address 2 Mask */
#define GMAC_SAT_ADDR(value)                  (GMAC_SAT_ADDR_Msk & (_UINT32_(value) << GMAC_SAT_ADDR_Pos)) /* Assigment of value for ADDR in the GMAC_SAT register */
#define GMAC_SAT_FILTSORD_Pos                 _UINT32_(16)                                         /* (GMAC_SAT) Filter Source or Destination MAC Address Position */
#define GMAC_SAT_FILTSORD_Msk                 (_UINT32_(0x1) << GMAC_SAT_FILTSORD_Pos)             /* (GMAC_SAT) Filter Source or Destination MAC Address Mask */
#define GMAC_SAT_FILTSORD(value)              (GMAC_SAT_FILTSORD_Msk & (_UINT32_(value) << GMAC_SAT_FILTSORD_Pos)) /* Assigment of value for FILTSORD in the GMAC_SAT register */
#define   GMAC_SAT_FILTSORD_0_Val             _UINT32_(0x0)                                        /* (GMAC_SAT) The filter is a destination address filter.  */
#define   GMAC_SAT_FILTSORD_1_Val             _UINT32_(0x1)                                        /* (GMAC_SAT) The filter is a source address filter.  */
#define GMAC_SAT_FILTSORD_0                   (GMAC_SAT_FILTSORD_0_Val << GMAC_SAT_FILTSORD_Pos)   /* (GMAC_SAT) The filter is a destination address filter. Position  */
#define GMAC_SAT_FILTSORD_1                   (GMAC_SAT_FILTSORD_1_Val << GMAC_SAT_FILTSORD_Pos)   /* (GMAC_SAT) The filter is a source address filter. Position  */
#define GMAC_SAT_FILTBMASK_Pos                _UINT32_(24)                                         /* (GMAC_SAT) Filter Bytes Mask Position */
#define GMAC_SAT_FILTBMASK_Msk                (_UINT32_(0x3F) << GMAC_SAT_FILTBMASK_Pos)           /* (GMAC_SAT) Filter Bytes Mask Mask */
#define GMAC_SAT_FILTBMASK(value)             (GMAC_SAT_FILTBMASK_Msk & (_UINT32_(value) << GMAC_SAT_FILTBMASK_Pos)) /* Assigment of value for FILTBMASK in the GMAC_SAT register */
#define   GMAC_SAT_FILTBMASK_BIT1_Val         _UINT32_(0x1)                                        /* (GMAC_SAT) Controls whether the first byte has been received.  */
#define   GMAC_SAT_FILTBMASK_BIT2_Val         _UINT32_(0x2)                                        /* (GMAC_SAT) Controls whether the second byte has been received.  */
#define   GMAC_SAT_FILTBMASK_BIT3_Val         _UINT32_(0x4)                                        /* (GMAC_SAT) Controls whether the third byte has been received.  */
#define   GMAC_SAT_FILTBMASK_BIT4_Val         _UINT32_(0x8)                                        /* (GMAC_SAT) Controls whether the fourth byte has been received.  */
#define   GMAC_SAT_FILTBMASK_BIT5_Val         _UINT32_(0x10)                                       /* (GMAC_SAT) Controls whether the fifth byte has been received.  */
#define   GMAC_SAT_FILTBMASK_BIT6_Val         _UINT32_(0x20)                                       /* (GMAC_SAT) Controls whether the sixth byte has been received  */
#define GMAC_SAT_FILTBMASK_BIT1               (GMAC_SAT_FILTBMASK_BIT1_Val << GMAC_SAT_FILTBMASK_Pos) /* (GMAC_SAT) Controls whether the first byte has been received. Position  */
#define GMAC_SAT_FILTBMASK_BIT2               (GMAC_SAT_FILTBMASK_BIT2_Val << GMAC_SAT_FILTBMASK_Pos) /* (GMAC_SAT) Controls whether the second byte has been received. Position  */
#define GMAC_SAT_FILTBMASK_BIT3               (GMAC_SAT_FILTBMASK_BIT3_Val << GMAC_SAT_FILTBMASK_Pos) /* (GMAC_SAT) Controls whether the third byte has been received. Position  */
#define GMAC_SAT_FILTBMASK_BIT4               (GMAC_SAT_FILTBMASK_BIT4_Val << GMAC_SAT_FILTBMASK_Pos) /* (GMAC_SAT) Controls whether the fourth byte has been received. Position  */
#define GMAC_SAT_FILTBMASK_BIT5               (GMAC_SAT_FILTBMASK_BIT5_Val << GMAC_SAT_FILTBMASK_Pos) /* (GMAC_SAT) Controls whether the fifth byte has been received. Position  */
#define GMAC_SAT_FILTBMASK_BIT6               (GMAC_SAT_FILTBMASK_BIT6_Val << GMAC_SAT_FILTBMASK_Pos) /* (GMAC_SAT) Controls whether the sixth byte has been received Position  */
#define GMAC_SAT_Msk                          _UINT32_(0x3F01FFFF)                                 /* (GMAC_SAT) Register Mask  */


