Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/gmac.h
/* -------- GMAC_ST2CW0 : (GMAC Offset: 0x00) (R/W 32) Screening Type 2 Compare Word 0 Register  -------- */
#define GMAC_ST2CW0_RESETVALUE                _UINT32_(0x00)                                       /*  (GMAC_ST2CW0) Screening Type 2 Compare Word 0 Register   Reset Value */

#define GMAC_ST2CW0_MASKVAL_Pos               _UINT32_(0)                                          /* (GMAC_ST2CW0) Mask Value Position */
#define GMAC_ST2CW0_MASKVAL_Msk               (_UINT32_(0xFFFF) << GMAC_ST2CW0_MASKVAL_Pos)        /* (GMAC_ST2CW0) Mask Value Mask */
#define GMAC_ST2CW0_MASKVAL(value)            (GMAC_ST2CW0_MASKVAL_Msk & (_UINT32_(value) << GMAC_ST2CW0_MASKVAL_Pos)) /* Assigment of value for MASKVAL in the GMAC_ST2CW0 register */
#define GMAC_ST2CW0_COMPVAL_Pos               _UINT32_(16)                                         /* (GMAC_ST2CW0) Compare Value Position */
#define GMAC_ST2CW0_COMPVAL_Msk               (_UINT32_(0xFFFF) << GMAC_ST2CW0_COMPVAL_Pos)        /* (GMAC_ST2CW0) Compare Value Mask */
#define GMAC_ST2CW0_COMPVAL(value)            (GMAC_ST2CW0_COMPVAL_Msk & (_UINT32_(value) << GMAC_ST2CW0_COMPVAL_Pos)) /* Assigment of value for COMPVAL in the GMAC_ST2CW0 register */
#define GMAC_ST2CW0_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (GMAC_ST2CW0) Register Mask  */


/* -------- GMAC_ST2CW1 : (GMAC Offset: 0x04) (R/W 32) Screening Type 2 Compare Word 1 Register  -------- */
#define GMAC_ST2CW1_RESETVALUE                _UINT32_(0x00)                                       /*  (GMAC_ST2CW1) Screening Type 2 Compare Word 1 Register   Reset Value */

#define GMAC_ST2CW1_OFFSVAL_Pos               _UINT32_(0)                                          /* (GMAC_ST2CW1) Offset Value in Bytes Position */
#define GMAC_ST2CW1_OFFSVAL_Msk               (_UINT32_(0x7F) << GMAC_ST2CW1_OFFSVAL_Pos)          /* (GMAC_ST2CW1) Offset Value in Bytes Mask */
#define GMAC_ST2CW1_OFFSVAL(value)            (GMAC_ST2CW1_OFFSVAL_Msk & (_UINT32_(value) << GMAC_ST2CW1_OFFSVAL_Pos)) /* Assigment of value for OFFSVAL in the GMAC_ST2CW1 register */
#define GMAC_ST2CW1_OFFSSTRT_Pos              _UINT32_(7)                                          /* (GMAC_ST2CW1) Ethernet Frame Offset Start Position */
#define GMAC_ST2CW1_OFFSSTRT_Msk              (_UINT32_(0x3) << GMAC_ST2CW1_OFFSSTRT_Pos)          /* (GMAC_ST2CW1) Ethernet Frame Offset Start Mask */
#define GMAC_ST2CW1_OFFSSTRT(value)           (GMAC_ST2CW1_OFFSSTRT_Msk & (_UINT32_(value) << GMAC_ST2CW1_OFFSSTRT_Pos)) /* Assigment of value for OFFSSTRT in the GMAC_ST2CW1 register */
#define   GMAC_ST2CW1_OFFSSTRT_FRAMESTART_Val _UINT32_(0x0)                                        /* (GMAC_ST2CW1) Offset from the start of the frame  */
#define   GMAC_ST2CW1_OFFSSTRT_ETHERTYPE_Val  _UINT32_(0x1)                                        /* (GMAC_ST2CW1) Offset from the byte after the EtherType field  */
#define   GMAC_ST2CW1_OFFSSTRT_IP_Val         _UINT32_(0x2)                                        /* (GMAC_ST2CW1) Offset from the byte after the IP header field  */
#define   GMAC_ST2CW1_OFFSSTRT_TCP_UDP_Val    _UINT32_(0x3)                                        /* (GMAC_ST2CW1) Offset from the byte after the TCP/UDP header field  */
#define GMAC_ST2CW1_OFFSSTRT_FRAMESTART       (GMAC_ST2CW1_OFFSSTRT_FRAMESTART_Val << GMAC_ST2CW1_OFFSSTRT_Pos) /* (GMAC_ST2CW1) Offset from the start of the frame Position  */
#define GMAC_ST2CW1_OFFSSTRT_ETHERTYPE        (GMAC_ST2CW1_OFFSSTRT_ETHERTYPE_Val << GMAC_ST2CW1_OFFSSTRT_Pos) /* (GMAC_ST2CW1) Offset from the byte after the EtherType field Position  */
#define GMAC_ST2CW1_OFFSSTRT_IP               (GMAC_ST2CW1_OFFSSTRT_IP_Val << GMAC_ST2CW1_OFFSSTRT_Pos) /* (GMAC_ST2CW1) Offset from the byte after the IP header field Position  */
#define GMAC_ST2CW1_OFFSSTRT_TCP_UDP          (GMAC_ST2CW1_OFFSSTRT_TCP_UDP_Val << GMAC_ST2CW1_OFFSSTRT_Pos) /* (GMAC_ST2CW1) Offset from the byte after the TCP/UDP header field Position  */
#define GMAC_ST2CW1_DISMASK_Pos               _UINT32_(9)                                          /* (GMAC_ST2CW1) Disable Mask Position */
#define GMAC_ST2CW1_DISMASK_Msk               (_UINT32_(0x1) << GMAC_ST2CW1_DISMASK_Pos)           /* (GMAC_ST2CW1) Disable Mask Mask */
#define GMAC_ST2CW1_DISMASK(value)            (GMAC_ST2CW1_DISMASK_Msk & (_UINT32_(value) << GMAC_ST2CW1_DISMASK_Pos)) /* Assigment of value for DISMASK in the GMAC_ST2CW1 register */
#define   GMAC_ST2CW1_DISMASK_0_Val           _UINT32_(0x0)                                        /* (GMAC_ST2CW1) GMAC_ST2CW0R contains a 2-byte compare value with a 2-byte mask value.  */
#define   GMAC_ST2CW1_DISMASK_1_Val           _UINT32_(0x1)                                        /* (GMAC_ST2CW1) GMAC_ST2CW0R contains a 4-byte compare value.  */
#define GMAC_ST2CW1_DISMASK_0                 (GMAC_ST2CW1_DISMASK_0_Val << GMAC_ST2CW1_DISMASK_Pos) /* (GMAC_ST2CW1) GMAC_ST2CW0R contains a 2-byte compare value with a 2-byte mask value. Position  */
#define GMAC_ST2CW1_DISMASK_1                 (GMAC_ST2CW1_DISMASK_1_Val << GMAC_ST2CW1_DISMASK_Pos) /* (GMAC_ST2CW1) GMAC_ST2CW0R contains a 4-byte compare value. Position  */
#define GMAC_ST2CW1_Msk                       _UINT32_(0x000003FF)                                 /* (GMAC_ST2CW1) Register Mask  */


/* -------- GMAC_NCR : (GMAC Offset: 0x00) (R/W 32) Network Control Register -------- */
#define GMAC_NCR_RESETVALUE                   _UINT32_(0x00)                                       /*  (GMAC_NCR) Network Control Register  Reset Value */

#define GMAC_NCR_LBL_Pos                      _UINT32_(1)                                          /* (GMAC_NCR) Loop Back Local Position */
#define GMAC_NCR_LBL_Msk                      (_UINT32_(0x1) << GMAC_NCR_LBL_Pos)                  /* (GMAC_NCR) Loop Back Local Mask */
#define GMAC_NCR_LBL(value)                   (GMAC_NCR_LBL_Msk & (_UINT32_(value) << GMAC_NCR_LBL_Pos)) /* Assigment of value for LBL in the GMAC_NCR register */
#define   GMAC_NCR_LBL_0_Val                  _UINT32_(0x0)                                        /* (GMAC_NCR) Normal operating mode (no loop back).  */
#define   GMAC_NCR_LBL_1_Val                  _UINT32_(0x1)                                        /* (GMAC_NCR) Connects GTX to GRX, GTXEN to GRXDV and forces Full Duplex mode. GRXCK and GTXCK may malfunction as the GMAC is switched into and out of internal loop back. It is important that receive and transmit circuits have already been disabled when making the switch into and out of internal loop back.  */
#define GMAC_NCR_LBL_0                        (GMAC_NCR_LBL_0_Val << GMAC_NCR_LBL_Pos)             /* (GMAC_NCR) Normal operating mode (no loop back). Position  */
#define GMAC_NCR_LBL_1                        (GMAC_NCR_LBL_1_Val << GMAC_NCR_LBL_Pos)             /* (GMAC_NCR) Connects GTX to GRX, GTXEN to GRXDV and forces Full Duplex mode. GRXCK and GTXCK may malfunction as the GMAC is switched into and out of internal loop back. It is important that receive and transmit circuits have already been disabled when making the switch into and out of internal loop back. Position  */
#define GMAC_NCR_RXEN_Pos                     _UINT32_(2)                                          /* (GMAC_NCR) Receive Enable Position */
#define GMAC_NCR_RXEN_Msk                     (_UINT32_(0x1) << GMAC_NCR_RXEN_Pos)                 /* (GMAC_NCR) Receive Enable Mask */
#define GMAC_NCR_RXEN(value)                  (GMAC_NCR_RXEN_Msk & (_UINT32_(value) << GMAC_NCR_RXEN_Pos)) /* Assigment of value for RXEN in the GMAC_NCR register */
#define   GMAC_NCR_RXEN_0_Val                 _UINT32_(0x0)                                        /* (GMAC_NCR) Stops frame reception immediately and the receive pipeline will be cleared. The Receive Queue Pointer register is unaffected.  */
#define   GMAC_NCR_RXEN_1_Val                 _UINT32_(0x1)                                        /* (GMAC_NCR) Enables the GMAC to receive data.  */
#define GMAC_NCR_RXEN_0                       (GMAC_NCR_RXEN_0_Val << GMAC_NCR_RXEN_Pos)           /* (GMAC_NCR) Stops frame reception immediately and the receive pipeline will be cleared. The Receive Queue Pointer register is unaffected. Position  */
#define GMAC_NCR_RXEN_1                       (GMAC_NCR_RXEN_1_Val << GMAC_NCR_RXEN_Pos)           /* (GMAC_NCR) Enables the GMAC to receive data. Position  */
#define GMAC_NCR_TXEN_Pos                     _UINT32_(3)                                          /* (GMAC_NCR) Transmit Enable Position */
#define GMAC_NCR_TXEN_Msk                     (_UINT32_(0x1) << GMAC_NCR_TXEN_Pos)                 /* (GMAC_NCR) Transmit Enable Mask */
#define GMAC_NCR_TXEN(value)                  (GMAC_NCR_TXEN_Msk & (_UINT32_(value) << GMAC_NCR_TXEN_Pos)) /* Assigment of value for TXEN in the GMAC_NCR register */
#define   GMAC_NCR_TXEN_0_Val                 _UINT32_(0x0)                                        /* (GMAC_NCR) Stops transmission immediately, the transmit pipeline and control registers will be cleared and the Transmit Queue Pointer Register will reset to point to the start of the transmit descriptor list.  */
#define   GMAC_NCR_TXEN_1_Val                 _UINT32_(0x1)                                        /* (GMAC_NCR) Enables the GMAC transmitter to send data.  */
#define GMAC_NCR_TXEN_0                       (GMAC_NCR_TXEN_0_Val << GMAC_NCR_TXEN_Pos)           /* (GMAC_NCR) Stops transmission immediately, the transmit pipeline and control registers will be cleared and the Transmit Queue Pointer Register will reset to point to the start of the transmit descriptor list. Position  */
#define GMAC_NCR_TXEN_1                       (GMAC_NCR_TXEN_1_Val << GMAC_NCR_TXEN_Pos)           /* (GMAC_NCR) Enables the GMAC transmitter to send data. Position  */
#define GMAC_NCR_MPE_Pos                      _UINT32_(4)                                          /* (GMAC_NCR) Management Port Enable Position */
#define GMAC_NCR_MPE_Msk                      (_UINT32_(0x1) << GMAC_NCR_MPE_Pos)                  /* (GMAC_NCR) Management Port Enable Mask */
#define GMAC_NCR_MPE(value)                   (GMAC_NCR_MPE_Msk & (_UINT32_(value) << GMAC_NCR_MPE_Pos)) /* Assigment of value for MPE in the GMAC_NCR register */
#define   GMAC_NCR_MPE_0_Val                  _UINT32_(0x0)                                        /* (GMAC_NCR) Forces GMDIO to high impedance state and MDC low.  */
#define   GMAC_NCR_MPE_1_Val                  _UINT32_(0x1)                                        /* (GMAC_NCR) Enables the management port.  */
#define GMAC_NCR_MPE_0                        (GMAC_NCR_MPE_0_Val << GMAC_NCR_MPE_Pos)             /* (GMAC_NCR) Forces GMDIO to high impedance state and MDC low. Position  */
#define GMAC_NCR_MPE_1                        (GMAC_NCR_MPE_1_Val << GMAC_NCR_MPE_Pos)             /* (GMAC_NCR) Enables the management port. Position  */
#define GMAC_NCR_CLRSTAT_Pos                  _UINT32_(5)                                          /* (GMAC_NCR) Clear Statistics Registers (Write-only) Position */
#define GMAC_NCR_CLRSTAT_Msk                  (_UINT32_(0x1) << GMAC_NCR_CLRSTAT_Pos)              /* (GMAC_NCR) Clear Statistics Registers (Write-only) Mask */
#define GMAC_NCR_CLRSTAT(value)               (GMAC_NCR_CLRSTAT_Msk & (_UINT32_(value) << GMAC_NCR_CLRSTAT_Pos)) /* Assigment of value for CLRSTAT in the GMAC_NCR register */
#define   GMAC_NCR_CLRSTAT_0_Val              _UINT32_(0x0)                                        /* (GMAC_NCR) No effect.  */
#define   GMAC_NCR_CLRSTAT_1_Val              _UINT32_(0x1)                                        /* (GMAC_NCR) Clears the statistics registers.  */
#define GMAC_NCR_CLRSTAT_0                    (GMAC_NCR_CLRSTAT_0_Val << GMAC_NCR_CLRSTAT_Pos)     /* (GMAC_NCR) No effect. Position  */
#define GMAC_NCR_CLRSTAT_1                    (GMAC_NCR_CLRSTAT_1_Val << GMAC_NCR_CLRSTAT_Pos)     /* (GMAC_NCR) Clears the statistics registers. Position  */
#define GMAC_NCR_INCSTAT_Pos                  _UINT32_(6)                                          /* (GMAC_NCR) Increment Statistics Registers (Write-only) Position */
#define GMAC_NCR_INCSTAT_Msk                  (_UINT32_(0x1) << GMAC_NCR_INCSTAT_Pos)              /* (GMAC_NCR) Increment Statistics Registers (Write-only) Mask */
#define GMAC_NCR_INCSTAT(value)               (GMAC_NCR_INCSTAT_Msk & (_UINT32_(value) << GMAC_NCR_INCSTAT_Pos)) /* Assigment of value for INCSTAT in the GMAC_NCR register */
#define GMAC_NCR_WESTAT_Pos                   _UINT32_(7)                                          /* (GMAC_NCR) Write Enable for Statistics Registers Position */
#define GMAC_NCR_WESTAT_Msk                   (_UINT32_(0x1) << GMAC_NCR_WESTAT_Pos)               /* (GMAC_NCR) Write Enable for Statistics Registers Mask */
#define GMAC_NCR_WESTAT(value)                (GMAC_NCR_WESTAT_Msk & (_UINT32_(value) << GMAC_NCR_WESTAT_Pos)) /* Assigment of value for WESTAT in the GMAC_NCR register */
#define   GMAC_NCR_WESTAT_0_Val               _UINT32_(0x0)                                        /* (GMAC_NCR) Forces the statistics registers to be in read-only mode for normal operation mode.  */
#define   GMAC_NCR_WESTAT_1_Val               _UINT32_(0x1)                                        /* (GMAC_NCR) Makes the statistics registers writable for functional test purposes.  */
#define GMAC_NCR_WESTAT_0                     (GMAC_NCR_WESTAT_0_Val << GMAC_NCR_WESTAT_Pos)       /* (GMAC_NCR) Forces the statistics registers to be in read-only mode for normal operation mode. Position  */
#define GMAC_NCR_WESTAT_1                     (GMAC_NCR_WESTAT_1_Val << GMAC_NCR_WESTAT_Pos)       /* (GMAC_NCR) Makes the statistics registers writable for functional test purposes. Position  */
#define GMAC_NCR_BP_Pos                       _UINT32_(8)                                          /* (GMAC_NCR) Back Pressure Position */
#define GMAC_NCR_BP_Msk                       (_UINT32_(0x1) << GMAC_NCR_BP_Pos)                   /* (GMAC_NCR) Back Pressure Mask */
#define GMAC_NCR_BP(value)                    (GMAC_NCR_BP_Msk & (_UINT32_(value) << GMAC_NCR_BP_Pos)) /* Assigment of value for BP in the GMAC_NCR register */
#define   GMAC_NCR_BP_0_Val                   _UINT32_(0x0)                                        /* (GMAC_NCR) No effect  */
#define   GMAC_NCR_BP_1_Val                   _UINT32_(0x1)                                        /* (GMAC_NCR) When the MAC is set in 10M or 100M Half Duplex mode, forces collisions on all received frames.  */
#define GMAC_NCR_BP_0                         (GMAC_NCR_BP_0_Val << GMAC_NCR_BP_Pos)               /* (GMAC_NCR) No effect Position  */
#define GMAC_NCR_BP_1                         (GMAC_NCR_BP_1_Val << GMAC_NCR_BP_Pos)               /* (GMAC_NCR) When the MAC is set in 10M or 100M Half Duplex mode, forces collisions on all received frames. Position  */
#define GMAC_NCR_TSTART_Pos                   _UINT32_(9)                                          /* (GMAC_NCR) Start Transmission (Write-only) Position */
#define GMAC_NCR_TSTART_Msk                   (_UINT32_(0x1) << GMAC_NCR_TSTART_Pos)               /* (GMAC_NCR) Start Transmission (Write-only) Mask */
#define GMAC_NCR_TSTART(value)                (GMAC_NCR_TSTART_Msk & (_UINT32_(value) << GMAC_NCR_TSTART_Pos)) /* Assigment of value for TSTART in the GMAC_NCR register */
#define   GMAC_NCR_TSTART_0_Val               _UINT32_(0x0)                                        /* (GMAC_NCR) No effect.  */
#define   GMAC_NCR_TSTART_1_Val               _UINT32_(0x1)                                        /* (GMAC_NCR) Starts transmission.  */
#define GMAC_NCR_TSTART_0                     (GMAC_NCR_TSTART_0_Val << GMAC_NCR_TSTART_Pos)       /* (GMAC_NCR) No effect. Position  */
#define GMAC_NCR_TSTART_1                     (GMAC_NCR_TSTART_1_Val << GMAC_NCR_TSTART_Pos)       /* (GMAC_NCR) Starts transmission. Position  */
#define GMAC_NCR_THALT_Pos                    _UINT32_(10)                                         /* (GMAC_NCR) Transmit Halt (Write-only) Position */
#define GMAC_NCR_THALT_Msk                    (_UINT32_(0x1) << GMAC_NCR_THALT_Pos)                /* (GMAC_NCR) Transmit Halt (Write-only) Mask */
#define GMAC_NCR_THALT(value)                 (GMAC_NCR_THALT_Msk & (_UINT32_(value) << GMAC_NCR_THALT_Pos)) /* Assigment of value for THALT in the GMAC_NCR register */
#define   GMAC_NCR_THALT_0_Val                _UINT32_(0x0)                                        /* (GMAC_NCR) No effect.  */
#define   GMAC_NCR_THALT_1_Val                _UINT32_(0x1)                                        /* (GMAC_NCR) Halts transmission as soon as any ongoing frame transmission ends.  */
#define GMAC_NCR_THALT_0                      (GMAC_NCR_THALT_0_Val << GMAC_NCR_THALT_Pos)         /* (GMAC_NCR) No effect. Position  */
#define GMAC_NCR_THALT_1                      (GMAC_NCR_THALT_1_Val << GMAC_NCR_THALT_Pos)         /* (GMAC_NCR) Halts transmission as soon as any ongoing frame transmission ends. Position  */
#define GMAC_NCR_TXPF_Pos                     _UINT32_(11)                                         /* (GMAC_NCR) Transmit Pause Frame (Write-only) Position */
#define GMAC_NCR_TXPF_Msk                     (_UINT32_(0x1) << GMAC_NCR_TXPF_Pos)                 /* (GMAC_NCR) Transmit Pause Frame (Write-only) Mask */
#define GMAC_NCR_TXPF(value)                  (GMAC_NCR_TXPF_Msk & (_UINT32_(value) << GMAC_NCR_TXPF_Pos)) /* Assigment of value for TXPF in the GMAC_NCR register */
#define   GMAC_NCR_TXPF_0_Val                 _UINT32_(0x0)                                        /* (GMAC_NCR) No effect.  */
#define   GMAC_NCR_TXPF_1_Val                 _UINT32_(0x1)                                        /* (GMAC_NCR) Generates a pause frame to be transmitted.  */
#define GMAC_NCR_TXPF_0                       (GMAC_NCR_TXPF_0_Val << GMAC_NCR_TXPF_Pos)           /* (GMAC_NCR) No effect. Position  */
#define GMAC_NCR_TXPF_1                       (GMAC_NCR_TXPF_1_Val << GMAC_NCR_TXPF_Pos)           /* (GMAC_NCR) Generates a pause frame to be transmitted. Position  */
#define GMAC_NCR_TXZQPF_Pos                   _UINT32_(12)                                         /* (GMAC_NCR) Transmit Zero Quantum Pause Frame (Write-only) Position */
#define GMAC_NCR_TXZQPF_Msk                   (_UINT32_(0x1) << GMAC_NCR_TXZQPF_Pos)               /* (GMAC_NCR) Transmit Zero Quantum Pause Frame (Write-only) Mask */
#define GMAC_NCR_TXZQPF(value)                (GMAC_NCR_TXZQPF_Msk & (_UINT32_(value) << GMAC_NCR_TXZQPF_Pos)) /* Assigment of value for TXZQPF in the GMAC_NCR register */
#define   GMAC_NCR_TXZQPF_0_Val               _UINT32_(0x0)                                        /* (GMAC_NCR) No effect.  */
#define   GMAC_NCR_TXZQPF_1_Val               _UINT32_(0x1)                                        /* (GMAC_NCR) Generates a pause frame with zero quantum to be transmitted.  */
#define GMAC_NCR_TXZQPF_0                     (GMAC_NCR_TXZQPF_0_Val << GMAC_NCR_TXZQPF_Pos)       /* (GMAC_NCR) No effect. Position  */
#define GMAC_NCR_TXZQPF_1                     (GMAC_NCR_TXZQPF_1_Val << GMAC_NCR_TXZQPF_Pos)       /* (GMAC_NCR) Generates a pause frame with zero quantum to be transmitted. Position  */
#define GMAC_NCR_SRTSM_Pos                    _UINT32_(15)                                         /* (GMAC_NCR) Store Receive Timestamp to Memory Position */
#define GMAC_NCR_SRTSM_Msk                    (_UINT32_(0x1) << GMAC_NCR_SRTSM_Pos)                /* (GMAC_NCR) Store Receive Timestamp to Memory Mask */
#define GMAC_NCR_SRTSM(value)                 (GMAC_NCR_SRTSM_Msk & (_UINT32_(value) << GMAC_NCR_SRTSM_Pos)) /* Assigment of value for SRTSM in the GMAC_NCR register */
#define   GMAC_NCR_SRTSM_0_Val                _UINT32_(0x0)                                        /* (GMAC_NCR) No effect.  */
#define   GMAC_NCR_SRTSM_1_Val                _UINT32_(0x1)                                        /* (GMAC_NCR) Causes the CRC of every received frame to be replaced with the value of the nanoseconds field of the 1588 timer that was captured as the receive frame passed the message timestamp point. Note that bit RFCS in register GMAC_NCFGR may not be set to 1 when the timer should be captured.  */
#define GMAC_NCR_SRTSM_0                      (GMAC_NCR_SRTSM_0_Val << GMAC_NCR_SRTSM_Pos)         /* (GMAC_NCR) No effect. Position  */
#define GMAC_NCR_SRTSM_1                      (GMAC_NCR_SRTSM_1_Val << GMAC_NCR_SRTSM_Pos)         /* (GMAC_NCR) Causes the CRC of every received frame to be replaced with the value of the nanoseconds field of the 1588 timer that was captured as the receive frame passed the message timestamp point. Note that bit RFCS in register GMAC_NCFGR may not be set to 1 when the timer should be captured. Position  */
#define GMAC_NCR_ENPBPR_Pos                   _UINT32_(16)                                         /* (GMAC_NCR) Enable PFC Priority-based Pause Reception Position */
#define GMAC_NCR_ENPBPR_Msk                   (_UINT32_(0x1) << GMAC_NCR_ENPBPR_Pos)               /* (GMAC_NCR) Enable PFC Priority-based Pause Reception Mask */
#define GMAC_NCR_ENPBPR(value)                (GMAC_NCR_ENPBPR_Msk & (_UINT32_(value) << GMAC_NCR_ENPBPR_Pos)) /* Assigment of value for ENPBPR in the GMAC_NCR register */
#define GMAC_NCR_TXPBPF_Pos                   _UINT32_(17)                                         /* (GMAC_NCR) Transmit PFC Priority-based Pause Frame Position */
#define GMAC_NCR_TXPBPF_Msk                   (_UINT32_(0x1) << GMAC_NCR_TXPBPF_Pos)               /* (GMAC_NCR) Transmit PFC Priority-based Pause Frame Mask */
#define GMAC_NCR_TXPBPF(value)                (GMAC_NCR_TXPBPF_Msk & (_UINT32_(value) << GMAC_NCR_TXPBPF_Pos)) /* Assigment of value for TXPBPF in the GMAC_NCR register */
#define   GMAC_NCR_TXPBPF_0_Val               _UINT32_(0x0)                                        /* (GMAC_NCR) No effect.  */
#define   GMAC_NCR_TXPBPF_1_Val               _UINT32_(0x1)                                        /* (GMAC_NCR) Takes the values stored in the Transmit PFC Pause Register.  */
#define GMAC_NCR_TXPBPF_0                     (GMAC_NCR_TXPBPF_0_Val << GMAC_NCR_TXPBPF_Pos)       /* (GMAC_NCR) No effect. Position  */
#define GMAC_NCR_TXPBPF_1                     (GMAC_NCR_TXPBPF_1_Val << GMAC_NCR_TXPBPF_Pos)       /* (GMAC_NCR) Takes the values stored in the Transmit PFC Pause Register. Position  */
#define GMAC_NCR_FNP_Pos                      _UINT32_(18)                                         /* (GMAC_NCR) Flush Next Packet Position */
#define GMAC_NCR_FNP_Msk                      (_UINT32_(0x1) << GMAC_NCR_FNP_Pos)                  /* (GMAC_NCR) Flush Next Packet Mask */
#define GMAC_NCR_FNP(value)                   (GMAC_NCR_FNP_Msk & (_UINT32_(value) << GMAC_NCR_FNP_Pos)) /* Assigment of value for FNP in the GMAC_NCR register */
#define   GMAC_NCR_FNP_0_Val                  _UINT32_(0x0)                                        /* (GMAC_NCR) No effect.  */
#define   GMAC_NCR_FNP_1_Val                  _UINT32_(0x1)                                        /* (GMAC_NCR) Flushes the next packet from the receive memory. This will only have an effect if the DMA is not currently writing a packet already stored in the receive memory to system memory.  */
#define GMAC_NCR_FNP_0                        (GMAC_NCR_FNP_0_Val << GMAC_NCR_FNP_Pos)             /* (GMAC_NCR) No effect. Position  */
#define GMAC_NCR_FNP_1                        (GMAC_NCR_FNP_1_Val << GMAC_NCR_FNP_Pos)             /* (GMAC_NCR) Flushes the next packet from the receive memory. This will only have an effect if the DMA is not currently writing a packet already stored in the receive memory to system memory. Position  */
#define GMAC_NCR_TXLPIEN_Pos                  _UINT32_(19)                                         /* (GMAC_NCR) Enable LPI Transmission Position */
