Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/gmac.h
#define GMAC_NCR_TXLPIEN_Msk                  (_UINT32_(0x1) << GMAC_NCR_TXLPIEN_Pos)              /* (GMAC_NCR) Enable LPI Transmission Mask */
#define GMAC_NCR_TXLPIEN(value)               (GMAC_NCR_TXLPIEN_Msk & (_UINT32_(value) << GMAC_NCR_TXLPIEN_Pos)) /* Assigment of value for TXLPIEN in the GMAC_NCR register */
#define GMAC_NCR_PTPUNIENA_Pos                _UINT32_(20)                                         /* (GMAC_NCR) Detection of Unicast PTP Frames Enable Position */
#define GMAC_NCR_PTPUNIENA_Msk                (_UINT32_(0x1) << GMAC_NCR_PTPUNIENA_Pos)            /* (GMAC_NCR) Detection of Unicast PTP Frames Enable Mask */
#define GMAC_NCR_PTPUNIENA(value)             (GMAC_NCR_PTPUNIENA_Msk & (_UINT32_(value) << GMAC_NCR_PTPUNIENA_Pos)) /* Assigment of value for PTPUNIENA in the GMAC_NCR register */
#define   GMAC_NCR_PTPUNIENA_0_Val            _UINT32_(0x0)                                        /* (GMAC_NCR) Disables detection of unicast PTP frames.  */
#define   GMAC_NCR_PTPUNIENA_1_Val            _UINT32_(0x1)                                        /* (GMAC_NCR) Enables detection of unicast PTP frames.  */
#define GMAC_NCR_PTPUNIENA_0                  (GMAC_NCR_PTPUNIENA_0_Val << GMAC_NCR_PTPUNIENA_Pos) /* (GMAC_NCR) Disables detection of unicast PTP frames. Position  */
#define GMAC_NCR_PTPUNIENA_1                  (GMAC_NCR_PTPUNIENA_1_Val << GMAC_NCR_PTPUNIENA_Pos) /* (GMAC_NCR) Enables detection of unicast PTP frames. Position  */
#define GMAC_NCR_STUDPOFFSET_Pos              _UINT32_(22)                                         /* (GMAC_NCR) Store UDP Offset Position */
#define GMAC_NCR_STUDPOFFSET_Msk              (_UINT32_(0x1) << GMAC_NCR_STUDPOFFSET_Pos)          /* (GMAC_NCR) Store UDP Offset Mask */
#define GMAC_NCR_STUDPOFFSET(value)           (GMAC_NCR_STUDPOFFSET_Msk & (_UINT32_(value) << GMAC_NCR_STUDPOFFSET_Pos)) /* Assigment of value for STUDPOFFSET in the GMAC_NCR register */
#define   GMAC_NCR_STUDPOFFSET_0_Val          _UINT32_(0x0)                                        /* (GMAC_NCR) Normal operations.  */
#define   GMAC_NCR_STUDPOFFSET_1_Val          _UINT32_(0x1)                                        /* (GMAC_NCR) The upper 16 bits of the CRC of every received frame are replaced with the offset from start of frame to the beginning of the UDP or TCP header. The lower 16 bits of the CRC are replaced with zero and reserved for future use. The offset is measured in units of 2 bytes.  */
#define GMAC_NCR_STUDPOFFSET_0                (GMAC_NCR_STUDPOFFSET_0_Val << GMAC_NCR_STUDPOFFSET_Pos) /* (GMAC_NCR) Normal operations. Position  */
#define GMAC_NCR_STUDPOFFSET_1                (GMAC_NCR_STUDPOFFSET_1_Val << GMAC_NCR_STUDPOFFSET_Pos) /* (GMAC_NCR) The upper 16 bits of the CRC of every received frame are replaced with the offset from start of frame to the beginning of the UDP or TCP header. The lower 16 bits of the CRC are replaced with zero and reserved for future use. The offset is measured in units of 2 bytes. Position  */
#define GMAC_NCR_OSSMODE_Pos                  _UINT32_(24)                                         /* (GMAC_NCR) One Step Sync Mode Position */
#define GMAC_NCR_OSSMODE_Msk                  (_UINT32_(0x1) << GMAC_NCR_OSSMODE_Pos)              /* (GMAC_NCR) One Step Sync Mode Mask */
#define GMAC_NCR_OSSMODE(value)               (GMAC_NCR_OSSMODE_Msk & (_UINT32_(value) << GMAC_NCR_OSSMODE_Pos)) /* Assigment of value for OSSMODE in the GMAC_NCR register */
#define   GMAC_NCR_OSSMODE_0_Val              _UINT32_(0x0)                                        /* (GMAC_NCR) 1588 One Step Sync Mode is disabled.  */
#define   GMAC_NCR_OSSMODE_1_Val              _UINT32_(0x1)                                        /* (GMAC_NCR) 1588 One Step Sync Mode is enabled. Replaces timestamp field in the 1588 header for TX Sync Frames with the current TSU timer value.  */
#define GMAC_NCR_OSSMODE_0                    (GMAC_NCR_OSSMODE_0_Val << GMAC_NCR_OSSMODE_Pos)     /* (GMAC_NCR) 1588 One Step Sync Mode is disabled. Position  */
#define GMAC_NCR_OSSMODE_1                    (GMAC_NCR_OSSMODE_1_Val << GMAC_NCR_OSSMODE_Pos)     /* (GMAC_NCR) 1588 One Step Sync Mode is enabled. Replaces timestamp field in the 1588 header for TX Sync Frames with the current TSU timer value. Position  */
#define GMAC_NCR_PFCCTL_Pos                   _UINT32_(25)                                         /* (GMAC_NCR) Multiple PFC Pause quantum Enable Position */
#define GMAC_NCR_PFCCTL_Msk                   (_UINT32_(0x1) << GMAC_NCR_PFCCTL_Pos)               /* (GMAC_NCR) Multiple PFC Pause quantum Enable Mask */
#define GMAC_NCR_PFCCTL(value)                (GMAC_NCR_PFCCTL_Msk & (_UINT32_(value) << GMAC_NCR_PFCCTL_Pos)) /* Assigment of value for PFCCTL in the GMAC_NCR register */
#define   GMAC_NCR_PFCCTL_0_Val               _UINT32_(0x0)                                        /* (GMAC_NCR) Disables multiple PFC pause quantums.  */
#define   GMAC_NCR_PFCCTL_1_Val               _UINT32_(0x1)                                        /* (GMAC_NCR) Enables multiple PFC pause quantums, one per pause priority.  */
#define GMAC_NCR_PFCCTL_0                     (GMAC_NCR_PFCCTL_0_Val << GMAC_NCR_PFCCTL_Pos)       /* (GMAC_NCR) Disables multiple PFC pause quantums. Position  */
#define GMAC_NCR_PFCCTL_1                     (GMAC_NCR_PFCCTL_1_Val << GMAC_NCR_PFCCTL_Pos)       /* (GMAC_NCR) Enables multiple PFC pause quantums, one per pause priority. Position  */
#define GMAC_NCR_EXTSELRQEN_Pos               _UINT32_(26)                                         /* (GMAC_NCR) External Selection of Receive Queue Enable Position */
#define GMAC_NCR_EXTSELRQEN_Msk               (_UINT32_(0x1) << GMAC_NCR_EXTSELRQEN_Pos)           /* (GMAC_NCR) External Selection of Receive Queue Enable Mask */
#define GMAC_NCR_EXTSELRQEN(value)            (GMAC_NCR_EXTSELRQEN_Msk & (_UINT32_(value) << GMAC_NCR_EXTSELRQEN_Pos)) /* Assigment of value for EXTSELRQEN in the GMAC_NCR register */
#define   GMAC_NCR_EXTSELRQEN_0_Val           _UINT32_(0x0)                                        /* (GMAC_NCR) Disables external selection of receive queue.  */
#define   GMAC_NCR_EXTSELRQEN_1_Val           _UINT32_(0x1)                                        /* (GMAC_NCR) Enables external selection of receive queue.  */
#define GMAC_NCR_EXTSELRQEN_0                 (GMAC_NCR_EXTSELRQEN_0_Val << GMAC_NCR_EXTSELRQEN_Pos) /* (GMAC_NCR) Disables external selection of receive queue. Position  */
#define GMAC_NCR_EXTSELRQEN_1                 (GMAC_NCR_EXTSELRQEN_1_Val << GMAC_NCR_EXTSELRQEN_Pos) /* (GMAC_NCR) Enables external selection of receive queue. Position  */
#define GMAC_NCR_OSSCORR_Pos                  _UINT32_(27)                                         /* (GMAC_NCR) OSS Correction Field Position */
#define GMAC_NCR_OSSCORR_Msk                  (_UINT32_(0x1) << GMAC_NCR_OSSCORR_Pos)              /* (GMAC_NCR) OSS Correction Field Mask */
#define GMAC_NCR_OSSCORR(value)               (GMAC_NCR_OSSCORR_Msk & (_UINT32_(value) << GMAC_NCR_OSSCORR_Pos)) /* Assigment of value for OSSCORR in the GMAC_NCR register */
#define GMAC_NCR_MIIONRGMII_Pos               _UINT32_(28)                                         /* (GMAC_NCR) MII Control Position */
#define GMAC_NCR_MIIONRGMII_Msk               (_UINT32_(0x1) << GMAC_NCR_MIIONRGMII_Pos)           /* (GMAC_NCR) MII Control Mask */
#define GMAC_NCR_MIIONRGMII(value)            (GMAC_NCR_MIIONRGMII_Msk & (_UINT32_(value) << GMAC_NCR_MIIONRGMII_Pos)) /* Assigment of value for MIIONRGMII in the GMAC_NCR register */
#define   GMAC_NCR_MIIONRGMII_0_Val           _UINT32_(0x0)                                        /* (GMAC_NCR) Disables MII operation.  */
#define GMAC_NCR_MIIONRGMII_0                 (GMAC_NCR_MIIONRGMII_0_Val << GMAC_NCR_MIIONRGMII_Pos) /* (GMAC_NCR) Disables MII operation. Position  */
#define GMAC_NCR_IFGQAVCRED_Pos               _UINT32_(30)                                         /* (GMAC_NCR) Credit-Based Shaping Algorithm Modification Position */
#define GMAC_NCR_IFGQAVCRED_Msk               (_UINT32_(0x1) << GMAC_NCR_IFGQAVCRED_Pos)           /* (GMAC_NCR) Credit-Based Shaping Algorithm Modification Mask */
#define GMAC_NCR_IFGQAVCRED(value)            (GMAC_NCR_IFGQAVCRED_Msk & (_UINT32_(value) << GMAC_NCR_IFGQAVCRED_Pos)) /* Assigment of value for IFGQAVCRED in the GMAC_NCR register */
#define   GMAC_NCR_IFGQAVCRED_0_Val           _UINT32_(0x0)                                        /* (GMAC_NCR) No modification of the CBS algorithm.  */
#define   GMAC_NCR_IFGQAVCRED_1_Val           _UINT32_(0x1)                                        /* (GMAC_NCR) Modifies the CBS algorithm so the IFG/IPG associated with a transmit frame counts towards its 802.1Qav credit.  */
#define GMAC_NCR_IFGQAVCRED_0                 (GMAC_NCR_IFGQAVCRED_0_Val << GMAC_NCR_IFGQAVCRED_Pos) /* (GMAC_NCR) No modification of the CBS algorithm. Position  */
#define GMAC_NCR_IFGQAVCRED_1                 (GMAC_NCR_IFGQAVCRED_1_Val << GMAC_NCR_IFGQAVCRED_Pos) /* (GMAC_NCR) Modifies the CBS algorithm so the IFG/IPG associated with a transmit frame counts towards its 802.1Qav credit. Position  */
#define GMAC_NCR_Msk                          _UINT32_(0x5F5F9FFE)                                 /* (GMAC_NCR) Register Mask  */


