Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/gmac.h
#define GMAC_DCFGR_FBLDO_Pos                  _UINT32_(0)                                          /* (GMAC_DCFGR) Fixed Burst Length for DMA Data Operations: Position */
#define GMAC_DCFGR_FBLDO_Msk                  (_UINT32_(0x1F) << GMAC_DCFGR_FBLDO_Pos)             /* (GMAC_DCFGR) Fixed Burst Length for DMA Data Operations: Mask */
#define GMAC_DCFGR_FBLDO(value)               (GMAC_DCFGR_FBLDO_Msk & (_UINT32_(value) << GMAC_DCFGR_FBLDO_Pos)) /* Assigment of value for FBLDO in the GMAC_DCFGR register */
#define   GMAC_DCFGR_FBLDO_SINGLE_Val         _UINT32_(0x1)                                        /* (GMAC_DCFGR) Always use single access on system bus  */
#define   GMAC_DCFGR_FBLDO_INCR4_Val          _UINT32_(0x4)                                        /* (GMAC_DCFGR) Attempt to use 4-beat bursts on system bus (Default)  */
#define   GMAC_DCFGR_FBLDO_INCR8_Val          _UINT32_(0x8)                                        /* (GMAC_DCFGR) Attempt to use 8-beat bursts on system bus bursts  */
#define   GMAC_DCFGR_FBLDO_INCR16_Val         _UINT32_(0x10)                                       /* (GMAC_DCFGR) Attempt to use 16-beat bursts on system bus bursts  */
#define GMAC_DCFGR_FBLDO_SINGLE               (GMAC_DCFGR_FBLDO_SINGLE_Val << GMAC_DCFGR_FBLDO_Pos) /* (GMAC_DCFGR) Always use single access on system bus Position  */
#define GMAC_DCFGR_FBLDO_INCR4                (GMAC_DCFGR_FBLDO_INCR4_Val << GMAC_DCFGR_FBLDO_Pos) /* (GMAC_DCFGR) Attempt to use 4-beat bursts on system bus (Default) Position  */
#define GMAC_DCFGR_FBLDO_INCR8                (GMAC_DCFGR_FBLDO_INCR8_Val << GMAC_DCFGR_FBLDO_Pos) /* (GMAC_DCFGR) Attempt to use 8-beat bursts on system bus bursts Position  */
#define GMAC_DCFGR_FBLDO_INCR16               (GMAC_DCFGR_FBLDO_INCR16_Val << GMAC_DCFGR_FBLDO_Pos) /* (GMAC_DCFGR) Attempt to use 16-beat bursts on system bus bursts Position  */
#define GMAC_DCFGR_ESMA_Pos                   _UINT32_(6)                                          /* (GMAC_DCFGR) Endian Swap Mode Enable for Management Descriptor Accesses Position */
#define GMAC_DCFGR_ESMA_Msk                   (_UINT32_(0x1) << GMAC_DCFGR_ESMA_Pos)               /* (GMAC_DCFGR) Endian Swap Mode Enable for Management Descriptor Accesses Mask */
#define GMAC_DCFGR_ESMA(value)                (GMAC_DCFGR_ESMA_Msk & (_UINT32_(value) << GMAC_DCFGR_ESMA_Pos)) /* Assigment of value for ESMA in the GMAC_DCFGR register */
#define   GMAC_DCFGR_ESMA_LITTLE_ENDIAN_Val   _UINT32_(0x0)                                        /* (GMAC_DCFGR) Selects Little-endian endianism for system bus transfers.  */
#define   GMAC_DCFGR_ESMA_BIG_ENDIAN_Val      _UINT32_(0x1)                                        /* (GMAC_DCFGR) Selects swapped endianism for system bus transfers.  */
#define GMAC_DCFGR_ESMA_LITTLE_ENDIAN         (GMAC_DCFGR_ESMA_LITTLE_ENDIAN_Val << GMAC_DCFGR_ESMA_Pos) /* (GMAC_DCFGR) Selects Little-endian endianism for system bus transfers. Position  */
#define GMAC_DCFGR_ESMA_BIG_ENDIAN            (GMAC_DCFGR_ESMA_BIG_ENDIAN_Val << GMAC_DCFGR_ESMA_Pos) /* (GMAC_DCFGR) Selects swapped endianism for system bus transfers. Position  */
#define GMAC_DCFGR_ESPA_Pos                   _UINT32_(7)                                          /* (GMAC_DCFGR) Endian Swap Mode Enable for Packet Data Accesses Position */
#define GMAC_DCFGR_ESPA_Msk                   (_UINT32_(0x1) << GMAC_DCFGR_ESPA_Pos)               /* (GMAC_DCFGR) Endian Swap Mode Enable for Packet Data Accesses Mask */
#define GMAC_DCFGR_ESPA(value)                (GMAC_DCFGR_ESPA_Msk & (_UINT32_(value) << GMAC_DCFGR_ESPA_Pos)) /* Assigment of value for ESPA in the GMAC_DCFGR register */
#define   GMAC_DCFGR_ESPA_LITTLE_ENDIAN_Val   _UINT32_(0x0)                                        /* (GMAC_DCFGR) Selects Little-endian endianism for system bus transfers.  */
#define   GMAC_DCFGR_ESPA_BIG_ENDIAN_Val      _UINT32_(0x1)                                        /* (GMAC_DCFGR) Selects swapped endianism for system bus transfers.  */
#define GMAC_DCFGR_ESPA_LITTLE_ENDIAN         (GMAC_DCFGR_ESPA_LITTLE_ENDIAN_Val << GMAC_DCFGR_ESPA_Pos) /* (GMAC_DCFGR) Selects Little-endian endianism for system bus transfers. Position  */
#define GMAC_DCFGR_ESPA_BIG_ENDIAN            (GMAC_DCFGR_ESPA_BIG_ENDIAN_Val << GMAC_DCFGR_ESPA_Pos) /* (GMAC_DCFGR) Selects swapped endianism for system bus transfers. Position  */
#define GMAC_DCFGR_RXBMS_Pos                  _UINT32_(8)                                          /* (GMAC_DCFGR) Receiver Packet Buffer Memory Size Select Position */
#define GMAC_DCFGR_RXBMS_Msk                  (_UINT32_(0x3) << GMAC_DCFGR_RXBMS_Pos)              /* (GMAC_DCFGR) Receiver Packet Buffer Memory Size Select Mask */
#define GMAC_DCFGR_RXBMS(value)               (GMAC_DCFGR_RXBMS_Msk & (_UINT32_(value) << GMAC_DCFGR_RXBMS_Pos)) /* Assigment of value for RXBMS in the GMAC_DCFGR register */
#define   GMAC_DCFGR_RXBMS_EIGHTH_Val         _UINT32_(0x0)                                        /* (GMAC_DCFGR) 4/8 Kbyte Memory Size  */
#define   GMAC_DCFGR_RXBMS_QUARTER_Val        _UINT32_(0x1)                                        /* (GMAC_DCFGR) 4/4 Kbytes Memory Size  */
#define   GMAC_DCFGR_RXBMS_HALF_Val           _UINT32_(0x2)                                        /* (GMAC_DCFGR) 4/2 Kbytes Memory Size  */
#define   GMAC_DCFGR_RXBMS_FULL_Val           _UINT32_(0x3)                                        /* (GMAC_DCFGR) 4 Kbytes Memory Size  */
#define GMAC_DCFGR_RXBMS_EIGHTH               (GMAC_DCFGR_RXBMS_EIGHTH_Val << GMAC_DCFGR_RXBMS_Pos) /* (GMAC_DCFGR) 4/8 Kbyte Memory Size Position  */
#define GMAC_DCFGR_RXBMS_QUARTER              (GMAC_DCFGR_RXBMS_QUARTER_Val << GMAC_DCFGR_RXBMS_Pos) /* (GMAC_DCFGR) 4/4 Kbytes Memory Size Position  */
#define GMAC_DCFGR_RXBMS_HALF                 (GMAC_DCFGR_RXBMS_HALF_Val << GMAC_DCFGR_RXBMS_Pos)  /* (GMAC_DCFGR) 4/2 Kbytes Memory Size Position  */
#define GMAC_DCFGR_RXBMS_FULL                 (GMAC_DCFGR_RXBMS_FULL_Val << GMAC_DCFGR_RXBMS_Pos)  /* (GMAC_DCFGR) 4 Kbytes Memory Size Position  */
#define GMAC_DCFGR_TXPBMS_Pos                 _UINT32_(10)                                         /* (GMAC_DCFGR) Transmitter Packet Buffer Memory Size Select Position */
#define GMAC_DCFGR_TXPBMS_Msk                 (_UINT32_(0x1) << GMAC_DCFGR_TXPBMS_Pos)             /* (GMAC_DCFGR) Transmitter Packet Buffer Memory Size Select Mask */
#define GMAC_DCFGR_TXPBMS(value)              (GMAC_DCFGR_TXPBMS_Msk & (_UINT32_(value) << GMAC_DCFGR_TXPBMS_Pos)) /* Assigment of value for TXPBMS in the GMAC_DCFGR register */
#define   GMAC_DCFGR_TXPBMS_TWO_KB_Val        _UINT32_(0x0)                                        /* (GMAC_DCFGR) Do not use top address bit (2 Kbytes).  */
#define   GMAC_DCFGR_TXPBMS_FOUR_KB_Val       _UINT32_(0x1)                                        /* (GMAC_DCFGR) Use full configured addressable space (4 Kbytes).  */
#define GMAC_DCFGR_TXPBMS_TWO_KB              (GMAC_DCFGR_TXPBMS_TWO_KB_Val << GMAC_DCFGR_TXPBMS_Pos) /* (GMAC_DCFGR) Do not use top address bit (2 Kbytes). Position  */
#define GMAC_DCFGR_TXPBMS_FOUR_KB             (GMAC_DCFGR_TXPBMS_FOUR_KB_Val << GMAC_DCFGR_TXPBMS_Pos) /* (GMAC_DCFGR) Use full configured addressable space (4 Kbytes). Position  */
#define GMAC_DCFGR_TXCOEN_Pos                 _UINT32_(11)                                         /* (GMAC_DCFGR) Transmitter Checksum Generation Offload Enable Position */
#define GMAC_DCFGR_TXCOEN_Msk                 (_UINT32_(0x1) << GMAC_DCFGR_TXCOEN_Pos)             /* (GMAC_DCFGR) Transmitter Checksum Generation Offload Enable Mask */
#define GMAC_DCFGR_TXCOEN(value)              (GMAC_DCFGR_TXCOEN_Msk & (_UINT32_(value) << GMAC_DCFGR_TXCOEN_Pos)) /* Assigment of value for TXCOEN in the GMAC_DCFGR register */
#define GMAC_DCFGR_INFLASTEN_Pos              _UINT32_(12)                                         /* (GMAC_DCFGR) Infinite Size for Last Buffer Enable Position */
#define GMAC_DCFGR_INFLASTEN_Msk              (_UINT32_(0x1) << GMAC_DCFGR_INFLASTEN_Pos)          /* (GMAC_DCFGR) Infinite Size for Last Buffer Enable Mask */
#define GMAC_DCFGR_INFLASTEN(value)           (GMAC_DCFGR_INFLASTEN_Msk & (_UINT32_(value) << GMAC_DCFGR_INFLASTEN_Pos)) /* Assigment of value for INFLASTEN in the GMAC_DCFGR register */
#define GMAC_DCFGR_CRCERRREP_Pos              _UINT32_(13)                                         /* (GMAC_DCFGR) CRC Errors Report Position */
#define GMAC_DCFGR_CRCERRREP_Msk              (_UINT32_(0x1) << GMAC_DCFGR_CRCERRREP_Pos)          /* (GMAC_DCFGR) CRC Errors Report Mask */
#define GMAC_DCFGR_CRCERRREP(value)           (GMAC_DCFGR_CRCERRREP_Msk & (_UINT32_(value) << GMAC_DCFGR_CRCERRREP_Pos)) /* Assigment of value for CRCERRREP in the GMAC_DCFGR register */
#define   GMAC_DCFGR_CRCERRREP_0_Val          _UINT32_(0x0)                                        /* (GMAC_DCFGR) Bit 16 of the receive buffer descriptor represents the Canonical format indicator (CFI) bit as extracted from the receive frame (if the receive buffer descriptor is pointing to the last data buffer of the receive frame and the received frame was VLAN tagged).  */
#define   GMAC_DCFGR_CRCERRREP_1_Val          _UINT32_(0x1)                                        /* (GMAC_DCFGR) Bit 16 of the receive buffer descriptor represents the FCS/CRC error (only if frames with FCS are copied to memory as enabled by bit 26 in the Network Configuration register).  */
#define GMAC_DCFGR_CRCERRREP_0                (GMAC_DCFGR_CRCERRREP_0_Val << GMAC_DCFGR_CRCERRREP_Pos) /* (GMAC_DCFGR) Bit 16 of the receive buffer descriptor represents the Canonical format indicator (CFI) bit as extracted from the receive frame (if the receive buffer descriptor is pointing to the last data buffer of the receive frame and the received frame was VLAN tagged). Position  */
#define GMAC_DCFGR_CRCERRREP_1                (GMAC_DCFGR_CRCERRREP_1_Val << GMAC_DCFGR_CRCERRREP_Pos) /* (GMAC_DCFGR) Bit 16 of the receive buffer descriptor represents the FCS/CRC error (only if frames with FCS are copied to memory as enabled by bit 26 in the Network Configuration register). Position  */
#define GMAC_DCFGR_DRBS_Pos                   _UINT32_(16)                                         /* (GMAC_DCFGR) DMA Receive Buffer Size Position */
#define GMAC_DCFGR_DRBS_Msk                   (_UINT32_(0xFF) << GMAC_DCFGR_DRBS_Pos)              /* (GMAC_DCFGR) DMA Receive Buffer Size Mask */
#define GMAC_DCFGR_DRBS(value)                (GMAC_DCFGR_DRBS_Msk & (_UINT32_(value) << GMAC_DCFGR_DRBS_Pos)) /* Assigment of value for DRBS in the GMAC_DCFGR register */
#define   GMAC_DCFGR_DRBS_0x02_Val            _UINT32_(0x2)                                        /* (GMAC_DCFGR) 128 bytes  */
#define   GMAC_DCFGR_DRBS_0x18_Val            _UINT32_(0x18)                                       /* (GMAC_DCFGR) 1536 bytes (1 x max length frame/buffer)  */
#define   GMAC_DCFGR_DRBS_0xA0_Val            _UINT32_(0xA0)                                       /* (GMAC_DCFGR) 10240 bytes (1 x 10K jumbo frame/buffer)  */
#define GMAC_DCFGR_DRBS_0x02                  (GMAC_DCFGR_DRBS_0x02_Val << GMAC_DCFGR_DRBS_Pos)    /* (GMAC_DCFGR) 128 bytes Position  */
#define GMAC_DCFGR_DRBS_0x18                  (GMAC_DCFGR_DRBS_0x18_Val << GMAC_DCFGR_DRBS_Pos)    /* (GMAC_DCFGR) 1536 bytes (1 x max length frame/buffer) Position  */
#define GMAC_DCFGR_DRBS_0xA0                  (GMAC_DCFGR_DRBS_0xA0_Val << GMAC_DCFGR_DRBS_Pos)    /* (GMAC_DCFGR) 10240 bytes (1 x 10K jumbo frame/buffer) Position  */
#define GMAC_DCFGR_DDRP_Pos                   _UINT32_(24)                                         /* (GMAC_DCFGR) DMA Discard Receive Packets Position */
#define GMAC_DCFGR_DDRP_Msk                   (_UINT32_(0x1) << GMAC_DCFGR_DDRP_Pos)               /* (GMAC_DCFGR) DMA Discard Receive Packets Mask */
#define GMAC_DCFGR_DDRP(value)                (GMAC_DCFGR_DDRP_Msk & (_UINT32_(value) << GMAC_DCFGR_DDRP_Pos)) /* Assigment of value for DDRP in the GMAC_DCFGR register */
#define GMAC_DCFGR_RXFOMAXB_Pos               _UINT32_(25)                                         /* (GMAC_DCFGR) Force Receive Max Burst Length Position */
#define GMAC_DCFGR_RXFOMAXB_Msk               (_UINT32_(0x1) << GMAC_DCFGR_RXFOMAXB_Pos)           /* (GMAC_DCFGR) Force Receive Max Burst Length Mask */
#define GMAC_DCFGR_RXFOMAXB(value)            (GMAC_DCFGR_RXFOMAXB_Msk & (_UINT32_(value) << GMAC_DCFGR_RXFOMAXB_Pos)) /* Assigment of value for RXFOMAXB in the GMAC_DCFGR register */
#define GMAC_DCFGR_TXFOMAXB_Pos               _UINT32_(26)                                         /* (GMAC_DCFGR) Force Transmit Max Burst Length Position */
#define GMAC_DCFGR_TXFOMAXB_Msk               (_UINT32_(0x1) << GMAC_DCFGR_TXFOMAXB_Pos)           /* (GMAC_DCFGR) Force Transmit Max Burst Length Mask */
#define GMAC_DCFGR_TXFOMAXB(value)            (GMAC_DCFGR_TXFOMAXB_Msk & (_UINT32_(value) << GMAC_DCFGR_TXFOMAXB_Pos)) /* Assigment of value for TXFOMAXB in the GMAC_DCFGR register */
#define GMAC_DCFGR_RXBD_EXTENDED_Pos          _UINT32_(28)                                         /* (GMAC_DCFGR) Receive Buffer Descriptor Extended Mode Position */
#define GMAC_DCFGR_RXBD_EXTENDED_Msk          (_UINT32_(0x1) << GMAC_DCFGR_RXBD_EXTENDED_Pos)      /* (GMAC_DCFGR) Receive Buffer Descriptor Extended Mode Mask */
#define GMAC_DCFGR_RXBD_EXTENDED(value)       (GMAC_DCFGR_RXBD_EXTENDED_Msk & (_UINT32_(value) << GMAC_DCFGR_RXBD_EXTENDED_Pos)) /* Assigment of value for RXBD_EXTENDED in the GMAC_DCFGR register */
#define   GMAC_DCFGR_RXBD_EXTENDED_0_Val      _UINT32_(0x0)                                        /* (GMAC_DCFGR) Disables Receive Buffer Data Extended mode.  */
#define   GMAC_DCFGR_RXBD_EXTENDED_1_Val      _UINT32_(0x1)                                        /* (GMAC_DCFGR) Enables Receive Buffer Data Extended mode.  */
#define GMAC_DCFGR_RXBD_EXTENDED_0            (GMAC_DCFGR_RXBD_EXTENDED_0_Val << GMAC_DCFGR_RXBD_EXTENDED_Pos) /* (GMAC_DCFGR) Disables Receive Buffer Data Extended mode. Position  */
#define GMAC_DCFGR_RXBD_EXTENDED_1            (GMAC_DCFGR_RXBD_EXTENDED_1_Val << GMAC_DCFGR_RXBD_EXTENDED_Pos) /* (GMAC_DCFGR) Enables Receive Buffer Data Extended mode. Position  */
#define GMAC_DCFGR_TXBD_EXTENDED_Pos          _UINT32_(29)                                         /* (GMAC_DCFGR) Transmit Buffer Descriptor Extended Mode Position */
#define GMAC_DCFGR_TXBD_EXTENDED_Msk          (_UINT32_(0x1) << GMAC_DCFGR_TXBD_EXTENDED_Pos)      /* (GMAC_DCFGR) Transmit Buffer Descriptor Extended Mode Mask */
#define GMAC_DCFGR_TXBD_EXTENDED(value)       (GMAC_DCFGR_TXBD_EXTENDED_Msk & (_UINT32_(value) << GMAC_DCFGR_TXBD_EXTENDED_Pos)) /* Assigment of value for TXBD_EXTENDED in the GMAC_DCFGR register */
#define   GMAC_DCFGR_TXBD_EXTENDED_0_Val      _UINT32_(0x0)                                        /* (GMAC_DCFGR) Disables Transmit Buffer Data Extended mode.  */
#define   GMAC_DCFGR_TXBD_EXTENDED_1_Val      _UINT32_(0x1)                                        /* (GMAC_DCFGR) Enables Transmit Buffer Data Extended mode.  */
#define GMAC_DCFGR_TXBD_EXTENDED_0            (GMAC_DCFGR_TXBD_EXTENDED_0_Val << GMAC_DCFGR_TXBD_EXTENDED_Pos) /* (GMAC_DCFGR) Disables Transmit Buffer Data Extended mode. Position  */
#define GMAC_DCFGR_TXBD_EXTENDED_1            (GMAC_DCFGR_TXBD_EXTENDED_1_Val << GMAC_DCFGR_TXBD_EXTENDED_Pos) /* (GMAC_DCFGR) Enables Transmit Buffer Data Extended mode. Position  */
#define GMAC_DCFGR_Msk                        _UINT32_(0x37FF3FDF)                                 /* (GMAC_DCFGR) Register Mask  */


