Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/gmac.h
#define GMAC_RJFML_FML_Pos                    _UINT32_(0)                                          /* (GMAC_RJFML) Frame Max Length Position */
#define GMAC_RJFML_FML_Msk                    (_UINT32_(0x3FFF) << GMAC_RJFML_FML_Pos)             /* (GMAC_RJFML) Frame Max Length Mask */
#define GMAC_RJFML_FML(value)                 (GMAC_RJFML_FML_Msk & (_UINT32_(value) << GMAC_RJFML_FML_Pos)) /* Assigment of value for FML in the GMAC_RJFML register */
#define GMAC_RJFML_Msk                        _UINT32_(0x00003FFF)                                 /* (GMAC_RJFML) Register Mask  */


/* -------- GMAC_INTM : (GMAC Offset: 0x5C) (R/W 32) Interrupt Moderation Register -------- */
#define GMAC_INTM_RESETVALUE                  _UINT32_(0x00)                                       /*  (GMAC_INTM) Interrupt Moderation Register  Reset Value */

#define GMAC_INTM_RXINTMOD_Pos                _UINT32_(0)                                          /* (GMAC_INTM) Receive Interrupt Moderation Position */
#define GMAC_INTM_RXINTMOD_Msk                (_UINT32_(0xFF) << GMAC_INTM_RXINTMOD_Pos)           /* (GMAC_INTM) Receive Interrupt Moderation Mask */
#define GMAC_INTM_RXINTMOD(value)             (GMAC_INTM_RXINTMOD_Msk & (_UINT32_(value) << GMAC_INTM_RXINTMOD_Pos)) /* Assigment of value for RXINTMOD in the GMAC_INTM register */
#define GMAC_INTM_TXINTMOD_Pos                _UINT32_(16)                                         /* (GMAC_INTM) Transmit Interrupt Moderation Position */
#define GMAC_INTM_TXINTMOD_Msk                (_UINT32_(0xFF) << GMAC_INTM_TXINTMOD_Pos)           /* (GMAC_INTM) Transmit Interrupt Moderation Mask */
#define GMAC_INTM_TXINTMOD(value)             (GMAC_INTM_TXINTMOD_Msk & (_UINT32_(value) << GMAC_INTM_TXINTMOD_Pos)) /* Assigment of value for TXINTMOD in the GMAC_INTM register */
#define GMAC_INTM_Msk                         _UINT32_(0x00FF00FF)                                 /* (GMAC_INTM) Register Mask  */


/* -------- GMAC_SYSWT : (GMAC Offset: 0x60) (R/W 32) System Wake-Up Time Register -------- */
#define GMAC_SYSWT_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_SYSWT) System Wake-Up Time Register  Reset Value */

#define GMAC_SYSWT_SYSWKUPTIME_Pos            _UINT32_(0)                                          /* (GMAC_SYSWT) System Wake-up Time Position */
#define GMAC_SYSWT_SYSWKUPTIME_Msk            (_UINT32_(0xFFFF) << GMAC_SYSWT_SYSWKUPTIME_Pos)     /* (GMAC_SYSWT) System Wake-up Time Mask */
#define GMAC_SYSWT_SYSWKUPTIME(value)         (GMAC_SYSWT_SYSWKUPTIME_Msk & (_UINT32_(value) << GMAC_SYSWT_SYSWKUPTIME_Pos)) /* Assigment of value for SYSWKUPTIME in the GMAC_SYSWT register */
#define GMAC_SYSWT_Msk                        _UINT32_(0x0000FFFF)                                 /* (GMAC_SYSWT) Register Mask  */


/* -------- GMAC_HRB : (GMAC Offset: 0x80) (R/W 32) Hash Register Bottom -------- */
#define GMAC_HRB_RESETVALUE                   _UINT32_(0x00)                                       /*  (GMAC_HRB) Hash Register Bottom  Reset Value */

#define GMAC_HRB_ADDR_Pos                     _UINT32_(0)                                          /* (GMAC_HRB) Hash Address Position */
#define GMAC_HRB_ADDR_Msk                     (_UINT32_(0xFFFFFFFF) << GMAC_HRB_ADDR_Pos)          /* (GMAC_HRB) Hash Address Mask */
#define GMAC_HRB_ADDR(value)                  (GMAC_HRB_ADDR_Msk & (_UINT32_(value) << GMAC_HRB_ADDR_Pos)) /* Assigment of value for ADDR in the GMAC_HRB register */
#define GMAC_HRB_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (GMAC_HRB) Register Mask  */


/* -------- GMAC_HRT : (GMAC Offset: 0x84) (R/W 32) Hash Register Top -------- */
#define GMAC_HRT_RESETVALUE                   _UINT32_(0x00)                                       /*  (GMAC_HRT) Hash Register Top  Reset Value */

#define GMAC_HRT_ADDR_Pos                     _UINT32_(0)                                          /* (GMAC_HRT) Hash Address Position */
#define GMAC_HRT_ADDR_Msk                     (_UINT32_(0xFFFFFFFF) << GMAC_HRT_ADDR_Pos)          /* (GMAC_HRT) Hash Address Mask */
#define GMAC_HRT_ADDR(value)                  (GMAC_HRT_ADDR_Msk & (_UINT32_(value) << GMAC_HRT_ADDR_Pos)) /* Assigment of value for ADDR in the GMAC_HRT register */
#define GMAC_HRT_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (GMAC_HRT) Register Mask  */


/* -------- GMAC_TIDM1 : (GMAC Offset: 0xA8) (R/W 32) Type ID Match 1 Register -------- */
#define GMAC_TIDM1_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_TIDM1) Type ID Match 1 Register  Reset Value */

#define GMAC_TIDM1_TID_Pos                    _UINT32_(0)                                          /* (GMAC_TIDM1) Type ID Match 1 Position */
#define GMAC_TIDM1_TID_Msk                    (_UINT32_(0xFFFF) << GMAC_TIDM1_TID_Pos)             /* (GMAC_TIDM1) Type ID Match 1 Mask */
#define GMAC_TIDM1_TID(value)                 (GMAC_TIDM1_TID_Msk & (_UINT32_(value) << GMAC_TIDM1_TID_Pos)) /* Assigment of value for TID in the GMAC_TIDM1 register */
#define GMAC_TIDM1_ENID1_Pos                  _UINT32_(31)                                         /* (GMAC_TIDM1) Enable Copying of TID Matched Frames Position */
#define GMAC_TIDM1_ENID1_Msk                  (_UINT32_(0x1) << GMAC_TIDM1_ENID1_Pos)              /* (GMAC_TIDM1) Enable Copying of TID Matched Frames Mask */
#define GMAC_TIDM1_ENID1(value)               (GMAC_TIDM1_ENID1_Msk & (_UINT32_(value) << GMAC_TIDM1_ENID1_Pos)) /* Assigment of value for ENID1 in the GMAC_TIDM1 register */
#define   GMAC_TIDM1_ENID1_0_Val              _UINT32_(0x0)                                        /* (GMAC_TIDM1) TID is not part of the comparison match.  */
#define   GMAC_TIDM1_ENID1_1_Val              _UINT32_(0x1)                                        /* (GMAC_TIDM1) TID is processed for the comparison match.  */
#define GMAC_TIDM1_ENID1_0                    (GMAC_TIDM1_ENID1_0_Val << GMAC_TIDM1_ENID1_Pos)     /* (GMAC_TIDM1) TID is not part of the comparison match. Position  */
#define GMAC_TIDM1_ENID1_1                    (GMAC_TIDM1_ENID1_1_Val << GMAC_TIDM1_ENID1_Pos)     /* (GMAC_TIDM1) TID is processed for the comparison match. Position  */
#define GMAC_TIDM1_Msk                        _UINT32_(0x8000FFFF)                                 /* (GMAC_TIDM1) Register Mask  */

