Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/gmac.h
#define GMAC_TIDM1_ENID_Pos                   _UINT32_(31)                                         /* (GMAC_TIDM1 Position) Enable Copying of TID Matched Frames */
#define GMAC_TIDM1_ENID_Msk                   (_UINT32_(0x1) << GMAC_TIDM1_ENID_Pos)               /* (GMAC_TIDM1 Mask) ENID */
#define GMAC_TIDM1_ENID(value)                (GMAC_TIDM1_ENID_Msk & (_UINT32_(value) << GMAC_TIDM1_ENID_Pos)) 

/* -------- GMAC_TIDM2 : (GMAC Offset: 0xAC) (R/W 32) Type ID Match 2 Register -------- */
#define GMAC_TIDM2_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_TIDM2) Type ID Match 2 Register  Reset Value */

#define GMAC_TIDM2_TID_Pos                    _UINT32_(0)                                          /* (GMAC_TIDM2) Type ID Match 2 Position */
#define GMAC_TIDM2_TID_Msk                    (_UINT32_(0xFFFF) << GMAC_TIDM2_TID_Pos)             /* (GMAC_TIDM2) Type ID Match 2 Mask */
#define GMAC_TIDM2_TID(value)                 (GMAC_TIDM2_TID_Msk & (_UINT32_(value) << GMAC_TIDM2_TID_Pos)) /* Assigment of value for TID in the GMAC_TIDM2 register */
#define GMAC_TIDM2_ENID2_Pos                  _UINT32_(31)                                         /* (GMAC_TIDM2) Enable Copying of TID Matched Frames Position */
#define GMAC_TIDM2_ENID2_Msk                  (_UINT32_(0x1) << GMAC_TIDM2_ENID2_Pos)              /* (GMAC_TIDM2) Enable Copying of TID Matched Frames Mask */
#define GMAC_TIDM2_ENID2(value)               (GMAC_TIDM2_ENID2_Msk & (_UINT32_(value) << GMAC_TIDM2_ENID2_Pos)) /* Assigment of value for ENID2 in the GMAC_TIDM2 register */
#define   GMAC_TIDM2_ENID2_0_Val              _UINT32_(0x0)                                        /* (GMAC_TIDM2) TID is not part of the comparison match.  */
#define   GMAC_TIDM2_ENID2_1_Val              _UINT32_(0x1)                                        /* (GMAC_TIDM2) TID is processed for the comparison match.  */
#define GMAC_TIDM2_ENID2_0                    (GMAC_TIDM2_ENID2_0_Val << GMAC_TIDM2_ENID2_Pos)     /* (GMAC_TIDM2) TID is not part of the comparison match. Position  */
#define GMAC_TIDM2_ENID2_1                    (GMAC_TIDM2_ENID2_1_Val << GMAC_TIDM2_ENID2_Pos)     /* (GMAC_TIDM2) TID is processed for the comparison match. Position  */
#define GMAC_TIDM2_Msk                        _UINT32_(0x8000FFFF)                                 /* (GMAC_TIDM2) Register Mask  */

#define GMAC_TIDM2_ENID_Pos                   _UINT32_(31)                                         /* (GMAC_TIDM2 Position) Enable Copying of TID Matched Frames */
#define GMAC_TIDM2_ENID_Msk                   (_UINT32_(0x1) << GMAC_TIDM2_ENID_Pos)               /* (GMAC_TIDM2 Mask) ENID */
#define GMAC_TIDM2_ENID(value)                (GMAC_TIDM2_ENID_Msk & (_UINT32_(value) << GMAC_TIDM2_ENID_Pos)) 

/* -------- GMAC_TIDM3 : (GMAC Offset: 0xB0) (R/W 32) Type ID Match 3 Register -------- */
#define GMAC_TIDM3_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_TIDM3) Type ID Match 3 Register  Reset Value */

#define GMAC_TIDM3_TID_Pos                    _UINT32_(0)                                          /* (GMAC_TIDM3) Type ID Match 3 Position */
#define GMAC_TIDM3_TID_Msk                    (_UINT32_(0xFFFF) << GMAC_TIDM3_TID_Pos)             /* (GMAC_TIDM3) Type ID Match 3 Mask */
#define GMAC_TIDM3_TID(value)                 (GMAC_TIDM3_TID_Msk & (_UINT32_(value) << GMAC_TIDM3_TID_Pos)) /* Assigment of value for TID in the GMAC_TIDM3 register */
#define GMAC_TIDM3_ENID3_Pos                  _UINT32_(31)                                         /* (GMAC_TIDM3) Enable Copying of TID Matched Frames Position */
#define GMAC_TIDM3_ENID3_Msk                  (_UINT32_(0x1) << GMAC_TIDM3_ENID3_Pos)              /* (GMAC_TIDM3) Enable Copying of TID Matched Frames Mask */
#define GMAC_TIDM3_ENID3(value)               (GMAC_TIDM3_ENID3_Msk & (_UINT32_(value) << GMAC_TIDM3_ENID3_Pos)) /* Assigment of value for ENID3 in the GMAC_TIDM3 register */
#define   GMAC_TIDM3_ENID3_0_Val              _UINT32_(0x0)                                        /* (GMAC_TIDM3) TID is not part of the comparison match.  */
#define   GMAC_TIDM3_ENID3_1_Val              _UINT32_(0x1)                                        /* (GMAC_TIDM3) TID is processed for the comparison match.  */
#define GMAC_TIDM3_ENID3_0                    (GMAC_TIDM3_ENID3_0_Val << GMAC_TIDM3_ENID3_Pos)     /* (GMAC_TIDM3) TID is not part of the comparison match. Position  */
#define GMAC_TIDM3_ENID3_1                    (GMAC_TIDM3_ENID3_1_Val << GMAC_TIDM3_ENID3_Pos)     /* (GMAC_TIDM3) TID is processed for the comparison match. Position  */
#define GMAC_TIDM3_Msk                        _UINT32_(0x8000FFFF)                                 /* (GMAC_TIDM3) Register Mask  */

#define GMAC_TIDM3_ENID_Pos                   _UINT32_(31)                                         /* (GMAC_TIDM3 Position) Enable Copying of TID Matched Frames */
#define GMAC_TIDM3_ENID_Msk                   (_UINT32_(0x1) << GMAC_TIDM3_ENID_Pos)               /* (GMAC_TIDM3 Mask) ENID */
#define GMAC_TIDM3_ENID(value)                (GMAC_TIDM3_ENID_Msk & (_UINT32_(value) << GMAC_TIDM3_ENID_Pos)) 

/* -------- GMAC_TIDM4 : (GMAC Offset: 0xB4) (R/W 32) Type ID Match 4 Register -------- */
#define GMAC_TIDM4_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_TIDM4) Type ID Match 4 Register  Reset Value */

#define GMAC_TIDM4_TID_Pos                    _UINT32_(0)                                          /* (GMAC_TIDM4) Type ID Match 4 Position */
#define GMAC_TIDM4_TID_Msk                    (_UINT32_(0xFFFF) << GMAC_TIDM4_TID_Pos)             /* (GMAC_TIDM4) Type ID Match 4 Mask */
#define GMAC_TIDM4_TID(value)                 (GMAC_TIDM4_TID_Msk & (_UINT32_(value) << GMAC_TIDM4_TID_Pos)) /* Assigment of value for TID in the GMAC_TIDM4 register */
#define GMAC_TIDM4_ENID4_Pos                  _UINT32_(31)                                         /* (GMAC_TIDM4) Enable Copying of TID Matched Frames Position */
#define GMAC_TIDM4_ENID4_Msk                  (_UINT32_(0x1) << GMAC_TIDM4_ENID4_Pos)              /* (GMAC_TIDM4) Enable Copying of TID Matched Frames Mask */
#define GMAC_TIDM4_ENID4(value)               (GMAC_TIDM4_ENID4_Msk & (_UINT32_(value) << GMAC_TIDM4_ENID4_Pos)) /* Assigment of value for ENID4 in the GMAC_TIDM4 register */
#define   GMAC_TIDM4_ENID4_0_Val              _UINT32_(0x0)                                        /* (GMAC_TIDM4) TID is not part of the comparison match.  */
#define   GMAC_TIDM4_ENID4_1_Val              _UINT32_(0x1)                                        /* (GMAC_TIDM4) TID is processed for the comparison match.  */
#define GMAC_TIDM4_ENID4_0                    (GMAC_TIDM4_ENID4_0_Val << GMAC_TIDM4_ENID4_Pos)     /* (GMAC_TIDM4) TID is not part of the comparison match. Position  */
#define GMAC_TIDM4_ENID4_1                    (GMAC_TIDM4_ENID4_1_Val << GMAC_TIDM4_ENID4_Pos)     /* (GMAC_TIDM4) TID is processed for the comparison match. Position  */
#define GMAC_TIDM4_Msk                        _UINT32_(0x8000FFFF)                                 /* (GMAC_TIDM4) Register Mask  */

#define GMAC_TIDM4_ENID_Pos                   _UINT32_(31)                                         /* (GMAC_TIDM4 Position) Enable Copying of TID Matched Frames */
#define GMAC_TIDM4_ENID_Msk                   (_UINT32_(0x1) << GMAC_TIDM4_ENID_Pos)               /* (GMAC_TIDM4 Mask) ENID */
#define GMAC_TIDM4_ENID(value)                (GMAC_TIDM4_ENID_Msk & (_UINT32_(value) << GMAC_TIDM4_ENID_Pos)) 

/* -------- GMAC_WOL : (GMAC Offset: 0xB8) (R/W 32) Wake on LAN Register -------- */
#define GMAC_WOL_RESETVALUE                   _UINT32_(0x00)                                       /*  (GMAC_WOL) Wake on LAN Register  Reset Value */

#define GMAC_WOL_IP_Pos                       _UINT32_(0)                                          /* (GMAC_WOL) ARP Request IP Address Position */
#define GMAC_WOL_IP_Msk                       (_UINT32_(0xFFFF) << GMAC_WOL_IP_Pos)                /* (GMAC_WOL) ARP Request IP Address Mask */
#define GMAC_WOL_IP(value)                    (GMAC_WOL_IP_Msk & (_UINT32_(value) << GMAC_WOL_IP_Pos)) /* Assigment of value for IP in the GMAC_WOL register */
#define GMAC_WOL_MAG_Pos                      _UINT32_(16)                                         /* (GMAC_WOL) Magic Packet Event Enable Position */
#define GMAC_WOL_MAG_Msk                      (_UINT32_(0x1) << GMAC_WOL_MAG_Pos)                  /* (GMAC_WOL) Magic Packet Event Enable Mask */
#define GMAC_WOL_MAG(value)                   (GMAC_WOL_MAG_Msk & (_UINT32_(value) << GMAC_WOL_MAG_Pos)) /* Assigment of value for MAG in the GMAC_WOL register */
#define GMAC_WOL_ARP_Pos                      _UINT32_(17)                                         /* (GMAC_WOL) ARP Request Event Enable Position */
#define GMAC_WOL_ARP_Msk                      (_UINT32_(0x1) << GMAC_WOL_ARP_Pos)                  /* (GMAC_WOL) ARP Request Event Enable Mask */
#define GMAC_WOL_ARP(value)                   (GMAC_WOL_ARP_Msk & (_UINT32_(value) << GMAC_WOL_ARP_Pos)) /* Assigment of value for ARP in the GMAC_WOL register */
#define GMAC_WOL_SA1_Pos                      _UINT32_(18)                                         /* (GMAC_WOL) Specific Address Register 1 Event Enable Position */
#define GMAC_WOL_SA1_Msk                      (_UINT32_(0x1) << GMAC_WOL_SA1_Pos)                  /* (GMAC_WOL) Specific Address Register 1 Event Enable Mask */
#define GMAC_WOL_SA1(value)                   (GMAC_WOL_SA1_Msk & (_UINT32_(value) << GMAC_WOL_SA1_Pos)) /* Assigment of value for SA1 in the GMAC_WOL register */
#define GMAC_WOL_MTI_Pos                      _UINT32_(19)                                         /* (GMAC_WOL) Multicast Hash Event Enable Position */
#define GMAC_WOL_MTI_Msk                      (_UINT32_(0x1) << GMAC_WOL_MTI_Pos)                  /* (GMAC_WOL) Multicast Hash Event Enable Mask */
#define GMAC_WOL_MTI(value)                   (GMAC_WOL_MTI_Msk & (_UINT32_(value) << GMAC_WOL_MTI_Pos)) /* Assigment of value for MTI in the GMAC_WOL register */
#define GMAC_WOL_Msk                          _UINT32_(0x000FFFFF)                                 /* (GMAC_WOL) Register Mask  */

