Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/gmac.h
#define GMAC_WOL_SA_Pos                       _UINT32_(18)                                         /* (GMAC_WOL Position) Specific Address Register x Event Enable */
#define GMAC_WOL_SA_Msk                       (_UINT32_(0x1) << GMAC_WOL_SA_Pos)                   /* (GMAC_WOL Mask) SA */
#define GMAC_WOL_SA(value)                    (GMAC_WOL_SA_Msk & (_UINT32_(value) << GMAC_WOL_SA_Pos)) 

/* -------- GMAC_IPGS : (GMAC Offset: 0xBC) (R/W 32) IPG Stretch Register -------- */
#define GMAC_IPGS_RESETVALUE                  _UINT32_(0x00)                                       /*  (GMAC_IPGS) IPG Stretch Register  Reset Value */

#define GMAC_IPGS_FL_Pos                      _UINT32_(0)                                          /* (GMAC_IPGS) Frame Length Position */
#define GMAC_IPGS_FL_Msk                      (_UINT32_(0xFFFF) << GMAC_IPGS_FL_Pos)               /* (GMAC_IPGS) Frame Length Mask */
#define GMAC_IPGS_FL(value)                   (GMAC_IPGS_FL_Msk & (_UINT32_(value) << GMAC_IPGS_FL_Pos)) /* Assigment of value for FL in the GMAC_IPGS register */
#define GMAC_IPGS_Msk                         _UINT32_(0x0000FFFF)                                 /* (GMAC_IPGS) Register Mask  */


/* -------- GMAC_SVLAN : (GMAC Offset: 0xC0) (R/W 32) Stacked VLAN Register -------- */
#define GMAC_SVLAN_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_SVLAN) Stacked VLAN Register  Reset Value */

#define GMAC_SVLAN_VLAN_TYPE_Pos              _UINT32_(0)                                          /* (GMAC_SVLAN) User Defined VLAN_TYPE Field Position */
#define GMAC_SVLAN_VLAN_TYPE_Msk              (_UINT32_(0xFFFF) << GMAC_SVLAN_VLAN_TYPE_Pos)       /* (GMAC_SVLAN) User Defined VLAN_TYPE Field Mask */
#define GMAC_SVLAN_VLAN_TYPE(value)           (GMAC_SVLAN_VLAN_TYPE_Msk & (_UINT32_(value) << GMAC_SVLAN_VLAN_TYPE_Pos)) /* Assigment of value for VLAN_TYPE in the GMAC_SVLAN register */
#define GMAC_SVLAN_ESVLAN_Pos                 _UINT32_(31)                                         /* (GMAC_SVLAN) Enable Stacked VLAN Processing Mode Position */
#define GMAC_SVLAN_ESVLAN_Msk                 (_UINT32_(0x1) << GMAC_SVLAN_ESVLAN_Pos)             /* (GMAC_SVLAN) Enable Stacked VLAN Processing Mode Mask */
#define GMAC_SVLAN_ESVLAN(value)              (GMAC_SVLAN_ESVLAN_Msk & (_UINT32_(value) << GMAC_SVLAN_ESVLAN_Pos)) /* Assigment of value for ESVLAN in the GMAC_SVLAN register */
#define   GMAC_SVLAN_ESVLAN_0_Val             _UINT32_(0x0)                                        /* (GMAC_SVLAN) Disable the stacked VLAN Processing mode  */
#define   GMAC_SVLAN_ESVLAN_1_Val             _UINT32_(0x1)                                        /* (GMAC_SVLAN) Enable the stacked VLAN Processing mode  */
#define GMAC_SVLAN_ESVLAN_0                   (GMAC_SVLAN_ESVLAN_0_Val << GMAC_SVLAN_ESVLAN_Pos)   /* (GMAC_SVLAN) Disable the stacked VLAN Processing mode Position  */
#define GMAC_SVLAN_ESVLAN_1                   (GMAC_SVLAN_ESVLAN_1_Val << GMAC_SVLAN_ESVLAN_Pos)   /* (GMAC_SVLAN) Enable the stacked VLAN Processing mode Position  */
#define GMAC_SVLAN_Msk                        _UINT32_(0x8000FFFF)                                 /* (GMAC_SVLAN) Register Mask  */


/* -------- GMAC_TPFCP : (GMAC Offset: 0xC4) (R/W 32) Transmit PFC Pause Register -------- */
#define GMAC_TPFCP_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_TPFCP) Transmit PFC Pause Register  Reset Value */

#define GMAC_TPFCP_PEV_Pos                    _UINT32_(0)                                          /* (GMAC_TPFCP) Priority Enable Vector Position */
#define GMAC_TPFCP_PEV_Msk                    (_UINT32_(0xFF) << GMAC_TPFCP_PEV_Pos)               /* (GMAC_TPFCP) Priority Enable Vector Mask */
#define GMAC_TPFCP_PEV(value)                 (GMAC_TPFCP_PEV_Msk & (_UINT32_(value) << GMAC_TPFCP_PEV_Pos)) /* Assigment of value for PEV in the GMAC_TPFCP register */
#define GMAC_TPFCP_PQ_Pos                     _UINT32_(8)                                          /* (GMAC_TPFCP) Pause Quantum Position */
#define GMAC_TPFCP_PQ_Msk                     (_UINT32_(0xFF) << GMAC_TPFCP_PQ_Pos)                /* (GMAC_TPFCP) Pause Quantum Mask */
#define GMAC_TPFCP_PQ(value)                  (GMAC_TPFCP_PQ_Msk & (_UINT32_(value) << GMAC_TPFCP_PQ_Pos)) /* Assigment of value for PQ in the GMAC_TPFCP register */
#define GMAC_TPFCP_Msk                        _UINT32_(0x0000FFFF)                                 /* (GMAC_TPFCP) Register Mask  */


/* -------- GMAC_SAMB1 : (GMAC Offset: 0xC8) (R/W 32) Specific Address 1 Mask Bottom Register -------- */
#define GMAC_SAMB1_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_SAMB1) Specific Address 1 Mask Bottom Register  Reset Value */

#define GMAC_SAMB1_ADDR_Pos                   _UINT32_(0)                                          /* (GMAC_SAMB1) Specific Address 1 Mask Position */
#define GMAC_SAMB1_ADDR_Msk                   (_UINT32_(0xFFFFFFFF) << GMAC_SAMB1_ADDR_Pos)        /* (GMAC_SAMB1) Specific Address 1 Mask Mask */
#define GMAC_SAMB1_ADDR(value)                (GMAC_SAMB1_ADDR_Msk & (_UINT32_(value) << GMAC_SAMB1_ADDR_Pos)) /* Assigment of value for ADDR in the GMAC_SAMB1 register */
#define GMAC_SAMB1_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (GMAC_SAMB1) Register Mask  */


/* -------- GMAC_SAMT1 : (GMAC Offset: 0xCC) (R/W 32) Specific Address 1 Mask Top Register -------- */
#define GMAC_SAMT1_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_SAMT1) Specific Address 1 Mask Top Register  Reset Value */

#define GMAC_SAMT1_ADDR_Pos                   _UINT32_(0)                                          /* (GMAC_SAMT1) Specific Address 1 Mask Position */
#define GMAC_SAMT1_ADDR_Msk                   (_UINT32_(0xFFFF) << GMAC_SAMT1_ADDR_Pos)            /* (GMAC_SAMT1) Specific Address 1 Mask Mask */
#define GMAC_SAMT1_ADDR(value)                (GMAC_SAMT1_ADDR_Msk & (_UINT32_(value) << GMAC_SAMT1_ADDR_Pos)) /* Assigment of value for ADDR in the GMAC_SAMT1 register */
#define GMAC_SAMT1_Msk                        _UINT32_(0x0000FFFF)                                 /* (GMAC_SAMT1) Register Mask  */


/* -------- GMAC_AMRX : (GMAC Offset: 0xD0) (R/W 32) System Memory Address Mask for RX Data Buffer Accesses Register -------- */
#define GMAC_AMRX_RESETVALUE                  _UINT32_(0x00)                                       /*  (GMAC_AMRX) System Memory Address Mask for RX Data Buffer Accesses Register  Reset Value */

#define GMAC_AMRX_MSBADDRMSK_Pos              _UINT32_(0)                                          /* (GMAC_AMRX) Mask of the Receive Data Buffer Address Position */
#define GMAC_AMRX_MSBADDRMSK_Msk              (_UINT32_(0xF) << GMAC_AMRX_MSBADDRMSK_Pos)          /* (GMAC_AMRX) Mask of the Receive Data Buffer Address Mask */
#define GMAC_AMRX_MSBADDRMSK(value)           (GMAC_AMRX_MSBADDRMSK_Msk & (_UINT32_(value) << GMAC_AMRX_MSBADDRMSK_Pos)) /* Assigment of value for MSBADDRMSK in the GMAC_AMRX register */
#define GMAC_AMRX_MSBADDR_Pos                 _UINT32_(28)                                         /* (GMAC_AMRX) MSB of the Receive Data Buffer Address Position */
#define GMAC_AMRX_MSBADDR_Msk                 (_UINT32_(0xF) << GMAC_AMRX_MSBADDR_Pos)             /* (GMAC_AMRX) MSB of the Receive Data Buffer Address Mask */
#define GMAC_AMRX_MSBADDR(value)              (GMAC_AMRX_MSBADDR_Msk & (_UINT32_(value) << GMAC_AMRX_MSBADDR_Pos)) /* Assigment of value for MSBADDR in the GMAC_AMRX register */
#define GMAC_AMRX_Msk                         _UINT32_(0xF000000F)                                 /* (GMAC_AMRX) Register Mask  */


/* -------- GMAC_RXUDAR : (GMAC Offset: 0xD4) (R/W 32) PTP RX Unicast IP Destination Address Register -------- */
#define GMAC_RXUDAR_RESETVALUE                _UINT32_(0x00)                                       /*  (GMAC_RXUDAR) PTP RX Unicast IP Destination Address Register  Reset Value */

#define GMAC_RXUDAR_RXUDA_Pos                 _UINT32_(0)                                          /* (GMAC_RXUDAR) Receive Unicast Destination Address Position */
#define GMAC_RXUDAR_RXUDA_Msk                 (_UINT32_(0xFFFFFFFF) << GMAC_RXUDAR_RXUDA_Pos)      /* (GMAC_RXUDAR) Receive Unicast Destination Address Mask */
#define GMAC_RXUDAR_RXUDA(value)              (GMAC_RXUDAR_RXUDA_Msk & (_UINT32_(value) << GMAC_RXUDAR_RXUDA_Pos)) /* Assigment of value for RXUDA in the GMAC_RXUDAR register */
#define GMAC_RXUDAR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (GMAC_RXUDAR) Register Mask  */


