Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/gmac.h
/* -------- GMAC_PEFRN : (GMAC Offset: 0x1FC) ( R/ 32) PTP Peer Event Frame Received Nanoseconds Register -------- */
#define GMAC_PEFRN_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_PEFRN) PTP Peer Event Frame Received Nanoseconds Register  Reset Value */

#define GMAC_PEFRN_RUD_Pos                    _UINT32_(0)                                          /* (GMAC_PEFRN) Register Update Position */
#define GMAC_PEFRN_RUD_Msk                    (_UINT32_(0x3FFFFFFF) << GMAC_PEFRN_RUD_Pos)         /* (GMAC_PEFRN) Register Update Mask */
#define GMAC_PEFRN_RUD(value)                 (GMAC_PEFRN_RUD_Msk & (_UINT32_(value) << GMAC_PEFRN_RUD_Pos)) /* Assigment of value for RUD in the GMAC_PEFRN register */
#define GMAC_PEFRN_Msk                        _UINT32_(0x3FFFFFFF)                                 /* (GMAC_PEFRN) Register Mask  */


/* -------- GMAC_RXLPI : (GMAC Offset: 0x270) ( R/ 32) Received LPI Transitions -------- */
#define GMAC_RXLPI_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_RXLPI) Received LPI Transitions  Reset Value */

#define GMAC_RXLPI_COUNT_Pos                  _UINT32_(0)                                          /* (GMAC_RXLPI) Count of Received LPI transitions (cleared on read) Position */
#define GMAC_RXLPI_COUNT_Msk                  (_UINT32_(0xFFFF) << GMAC_RXLPI_COUNT_Pos)           /* (GMAC_RXLPI) Count of Received LPI transitions (cleared on read) Mask */
#define GMAC_RXLPI_COUNT(value)               (GMAC_RXLPI_COUNT_Msk & (_UINT32_(value) << GMAC_RXLPI_COUNT_Pos)) /* Assigment of value for COUNT in the GMAC_RXLPI register */
#define GMAC_RXLPI_Msk                        _UINT32_(0x0000FFFF)                                 /* (GMAC_RXLPI) Register Mask  */


/* -------- GMAC_RXLPITIME : (GMAC Offset: 0x274) ( R/ 32) Received LPI Time -------- */
#define GMAC_RXLPITIME_RESETVALUE             _UINT32_(0x00)                                       /*  (GMAC_RXLPITIME) Received LPI Time  Reset Value */

#define GMAC_RXLPITIME_LPITIME_Pos            _UINT32_(0)                                          /* (GMAC_RXLPITIME) Time in LPI (cleared on read) Position */
#define GMAC_RXLPITIME_LPITIME_Msk            (_UINT32_(0xFFFFFF) << GMAC_RXLPITIME_LPITIME_Pos)   /* (GMAC_RXLPITIME) Time in LPI (cleared on read) Mask */
#define GMAC_RXLPITIME_LPITIME(value)         (GMAC_RXLPITIME_LPITIME_Msk & (_UINT32_(value) << GMAC_RXLPITIME_LPITIME_Pos)) /* Assigment of value for LPITIME in the GMAC_RXLPITIME register */
#define GMAC_RXLPITIME_Msk                    _UINT32_(0x00FFFFFF)                                 /* (GMAC_RXLPITIME) Register Mask  */


/* -------- GMAC_TXLPI : (GMAC Offset: 0x278) ( R/ 32) Transmit LPI Transitions -------- */
#define GMAC_TXLPI_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_TXLPI) Transmit LPI Transitions  Reset Value */

#define GMAC_TXLPI_COUNT_Pos                  _UINT32_(0)                                          /* (GMAC_TXLPI) Count of LPI transitions (cleared on read) Position */
#define GMAC_TXLPI_COUNT_Msk                  (_UINT32_(0xFFFF) << GMAC_TXLPI_COUNT_Pos)           /* (GMAC_TXLPI) Count of LPI transitions (cleared on read) Mask */
#define GMAC_TXLPI_COUNT(value)               (GMAC_TXLPI_COUNT_Msk & (_UINT32_(value) << GMAC_TXLPI_COUNT_Pos)) /* Assigment of value for COUNT in the GMAC_TXLPI register */
#define GMAC_TXLPI_Msk                        _UINT32_(0x0000FFFF)                                 /* (GMAC_TXLPI) Register Mask  */


/* -------- GMAC_TXLPITIME : (GMAC Offset: 0x27C) ( R/ 32) Transmit LPI Time -------- */
#define GMAC_TXLPITIME_RESETVALUE             _UINT32_(0x00)                                       /*  (GMAC_TXLPITIME) Transmit LPI Time  Reset Value */

#define GMAC_TXLPITIME_LPITIME_Pos            _UINT32_(0)                                          /* (GMAC_TXLPITIME) Time in LPI (cleared on read) Position */
#define GMAC_TXLPITIME_LPITIME_Msk            (_UINT32_(0xFFFFFF) << GMAC_TXLPITIME_LPITIME_Pos)   /* (GMAC_TXLPITIME) Time in LPI (cleared on read) Mask */
#define GMAC_TXLPITIME_LPITIME(value)         (GMAC_TXLPITIME_LPITIME_Msk & (_UINT32_(value) << GMAC_TXLPITIME_LPITIME_Pos)) /* Assigment of value for LPITIME in the GMAC_TXLPITIME register */
#define GMAC_TXLPITIME_Msk                    _UINT32_(0x00FFFFFF)                                 /* (GMAC_TXLPITIME) Register Mask  */


/* -------- GMAC_ISRPQ : (GMAC Offset: 0x400) ( R/ 32) Interrupt Status Register Priority Queue (index = 1) -------- */
#define GMAC_ISRPQ_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_ISRPQ) Interrupt Status Register Priority Queue (index = 1)  Reset Value */

#define GMAC_ISRPQ_RCOMP_Pos                  _UINT32_(1)                                          /* (GMAC_ISRPQ) Receive Complete Position */
#define GMAC_ISRPQ_RCOMP_Msk                  (_UINT32_(0x1) << GMAC_ISRPQ_RCOMP_Pos)              /* (GMAC_ISRPQ) Receive Complete Mask */
#define GMAC_ISRPQ_RCOMP(value)               (GMAC_ISRPQ_RCOMP_Msk & (_UINT32_(value) << GMAC_ISRPQ_RCOMP_Pos)) /* Assigment of value for RCOMP in the GMAC_ISRPQ register */
#define GMAC_ISRPQ_RXUBR_Pos                  _UINT32_(2)                                          /* (GMAC_ISRPQ) RX Used Bit Read Position */
#define GMAC_ISRPQ_RXUBR_Msk                  (_UINT32_(0x1) << GMAC_ISRPQ_RXUBR_Pos)              /* (GMAC_ISRPQ) RX Used Bit Read Mask */
#define GMAC_ISRPQ_RXUBR(value)               (GMAC_ISRPQ_RXUBR_Msk & (_UINT32_(value) << GMAC_ISRPQ_RXUBR_Pos)) /* Assigment of value for RXUBR in the GMAC_ISRPQ register */
#define GMAC_ISRPQ_RLEX_Pos                   _UINT32_(5)                                          /* (GMAC_ISRPQ) Retry Limit Exceeded or Late Collision Position */
#define GMAC_ISRPQ_RLEX_Msk                   (_UINT32_(0x1) << GMAC_ISRPQ_RLEX_Pos)               /* (GMAC_ISRPQ) Retry Limit Exceeded or Late Collision Mask */
#define GMAC_ISRPQ_RLEX(value)                (GMAC_ISRPQ_RLEX_Msk & (_UINT32_(value) << GMAC_ISRPQ_RLEX_Pos)) /* Assigment of value for RLEX in the GMAC_ISRPQ register */
#define GMAC_ISRPQ_TFC_Pos                    _UINT32_(6)                                          /* (GMAC_ISRPQ) Transmit Frame Corruption Due to System Bus Error Position */
#define GMAC_ISRPQ_TFC_Msk                    (_UINT32_(0x1) << GMAC_ISRPQ_TFC_Pos)                /* (GMAC_ISRPQ) Transmit Frame Corruption Due to System Bus Error Mask */
#define GMAC_ISRPQ_TFC(value)                 (GMAC_ISRPQ_TFC_Msk & (_UINT32_(value) << GMAC_ISRPQ_TFC_Pos)) /* Assigment of value for TFC in the GMAC_ISRPQ register */
#define GMAC_ISRPQ_TCOMP_Pos                  _UINT32_(7)                                          /* (GMAC_ISRPQ) Transmit Complete Position */
#define GMAC_ISRPQ_TCOMP_Msk                  (_UINT32_(0x1) << GMAC_ISRPQ_TCOMP_Pos)              /* (GMAC_ISRPQ) Transmit Complete Mask */
#define GMAC_ISRPQ_TCOMP(value)               (GMAC_ISRPQ_TCOMP_Msk & (_UINT32_(value) << GMAC_ISRPQ_TCOMP_Pos)) /* Assigment of value for TCOMP in the GMAC_ISRPQ register */
#define GMAC_ISRPQ_HRESP_Pos                  _UINT32_(11)                                         /* (GMAC_ISRPQ) System Bus Error Position */
#define GMAC_ISRPQ_HRESP_Msk                  (_UINT32_(0x1) << GMAC_ISRPQ_HRESP_Pos)              /* (GMAC_ISRPQ) System Bus Error Mask */
#define GMAC_ISRPQ_HRESP(value)               (GMAC_ISRPQ_HRESP_Msk & (_UINT32_(value) << GMAC_ISRPQ_HRESP_Pos)) /* Assigment of value for HRESP in the GMAC_ISRPQ register */
#define GMAC_ISRPQ_Msk                        _UINT32_(0x000008E6)                                 /* (GMAC_ISRPQ) Register Mask  */


/* -------- GMAC_TBQBAPQ : (GMAC Offset: 0x440) (R/W 32) Transmit Buffer Queue Base Address Register Priority Queue (index = 1) -------- */
#define GMAC_TBQBAPQ_RESETVALUE               _UINT32_(0x00)                                       /*  (GMAC_TBQBAPQ) Transmit Buffer Queue Base Address Register Priority Queue (index = 1)  Reset Value */

#define GMAC_TBQBAPQ_TXBQBA_Pos               _UINT32_(2)                                          /* (GMAC_TBQBAPQ) Transmit Buffer Queue Base Address Position */
#define GMAC_TBQBAPQ_TXBQBA_Msk               (_UINT32_(0x3FFFFFFF) << GMAC_TBQBAPQ_TXBQBA_Pos)    /* (GMAC_TBQBAPQ) Transmit Buffer Queue Base Address Mask */
#define GMAC_TBQBAPQ_TXBQBA(value)            (GMAC_TBQBAPQ_TXBQBA_Msk & (_UINT32_(value) << GMAC_TBQBAPQ_TXBQBA_Pos)) /* Assigment of value for TXBQBA in the GMAC_TBQBAPQ register */
#define GMAC_TBQBAPQ_Msk                      _UINT32_(0xFFFFFFFC)                                 /* (GMAC_TBQBAPQ) Register Mask  */


/* -------- GMAC_RBQBAPQ : (GMAC Offset: 0x480) (R/W 32) Receive Buffer Queue Base Address Register Priority Queue (index = 1) -------- */
#define GMAC_RBQBAPQ_RESETVALUE               _UINT32_(0x00)                                       /*  (GMAC_RBQBAPQ) Receive Buffer Queue Base Address Register Priority Queue (index = 1)  Reset Value */

#define GMAC_RBQBAPQ_RXBQBA_Pos               _UINT32_(2)                                          /* (GMAC_RBQBAPQ) Receive Buffer Queue Base Address Position */
#define GMAC_RBQBAPQ_RXBQBA_Msk               (_UINT32_(0x3FFFFFFF) << GMAC_RBQBAPQ_RXBQBA_Pos)    /* (GMAC_RBQBAPQ) Receive Buffer Queue Base Address Mask */
#define GMAC_RBQBAPQ_RXBQBA(value)            (GMAC_RBQBAPQ_RXBQBA_Msk & (_UINT32_(value) << GMAC_RBQBAPQ_RXBQBA_Pos)) /* Assigment of value for RXBQBA in the GMAC_RBQBAPQ register */
#define GMAC_RBQBAPQ_Msk                      _UINT32_(0xFFFFFFFC)                                 /* (GMAC_RBQBAPQ) Register Mask  */


/* -------- GMAC_RBSRPQ : (GMAC Offset: 0x4A0) (R/W 32) Receive Buffer Size Register Priority Queue (index = 1) -------- */
#define GMAC_RBSRPQ_RESETVALUE                _UINT32_(0x02)                                       /*  (GMAC_RBSRPQ) Receive Buffer Size Register Priority Queue (index = 1)  Reset Value */

