Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/gmac.h
#define GMAC_RBSRPQ_RBS_Pos                   _UINT32_(0)                                          /* (GMAC_RBSRPQ) Receive Buffer Size Position */
#define GMAC_RBSRPQ_RBS_Msk                   (_UINT32_(0xFF) << GMAC_RBSRPQ_RBS_Pos)              /* (GMAC_RBSRPQ) Receive Buffer Size Mask */
#define GMAC_RBSRPQ_RBS(value)                (GMAC_RBSRPQ_RBS_Msk & (_UINT32_(value) << GMAC_RBSRPQ_RBS_Pos)) /* Assigment of value for RBS in the GMAC_RBSRPQ register */
#define   GMAC_RBSRPQ_RBS_0x02_Val            _UINT32_(0x2)                                        /* (GMAC_RBSRPQ) 128 bytes  */
#define   GMAC_RBSRPQ_RBS_0x18_Val            _UINT32_(0x18)                                       /* (GMAC_RBSRPQ) 1536 bytes (1 x max length frame/buffer)  */
#define   GMAC_RBSRPQ_RBS_0xA0_Val            _UINT32_(0xA0)                                       /* (GMAC_RBSRPQ) 10240 bytes (1 x 10K jumbo frame/buffer)  */
#define GMAC_RBSRPQ_RBS_0x02                  (GMAC_RBSRPQ_RBS_0x02_Val << GMAC_RBSRPQ_RBS_Pos)    /* (GMAC_RBSRPQ) 128 bytes Position  */
#define GMAC_RBSRPQ_RBS_0x18                  (GMAC_RBSRPQ_RBS_0x18_Val << GMAC_RBSRPQ_RBS_Pos)    /* (GMAC_RBSRPQ) 1536 bytes (1 x max length frame/buffer) Position  */
#define GMAC_RBSRPQ_RBS_0xA0                  (GMAC_RBSRPQ_RBS_0xA0_Val << GMAC_RBSRPQ_RBS_Pos)    /* (GMAC_RBSRPQ) 10240 bytes (1 x 10K jumbo frame/buffer) Position  */
#define GMAC_RBSRPQ_Msk                       _UINT32_(0x000000FF)                                 /* (GMAC_RBSRPQ) Register Mask  */


/* -------- GMAC_CBSCR : (GMAC Offset: 0x4BC) (R/W 32) Credit-Based Shaping Control Register -------- */
#define GMAC_CBSCR_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_CBSCR) Credit-Based Shaping Control Register  Reset Value */

#define GMAC_CBSCR_QAE_Pos                    _UINT32_(0)                                          /* (GMAC_CBSCR) Queue A CBS Enable Position */
#define GMAC_CBSCR_QAE_Msk                    (_UINT32_(0x1) << GMAC_CBSCR_QAE_Pos)                /* (GMAC_CBSCR) Queue A CBS Enable Mask */
#define GMAC_CBSCR_QAE(value)                 (GMAC_CBSCR_QAE_Msk & (_UINT32_(value) << GMAC_CBSCR_QAE_Pos)) /* Assigment of value for QAE in the GMAC_CBSCR register */
#define   GMAC_CBSCR_QAE_0_Val                _UINT32_(0x0)                                        /* (GMAC_CBSCR) Credit-based shaping on the second highest priority queue (queue A) is disabled.  */
#define   GMAC_CBSCR_QAE_1_Val                _UINT32_(0x1)                                        /* (GMAC_CBSCR) Credit-based shaping on the second highest priority queue (queue A) is enabled.  */
#define GMAC_CBSCR_QAE_0                      (GMAC_CBSCR_QAE_0_Val << GMAC_CBSCR_QAE_Pos)         /* (GMAC_CBSCR) Credit-based shaping on the second highest priority queue (queue A) is disabled. Position  */
#define GMAC_CBSCR_QAE_1                      (GMAC_CBSCR_QAE_1_Val << GMAC_CBSCR_QAE_Pos)         /* (GMAC_CBSCR) Credit-based shaping on the second highest priority queue (queue A) is enabled. Position  */
#define GMAC_CBSCR_QBE_Pos                    _UINT32_(1)                                          /* (GMAC_CBSCR) Queue B CBS Enable Position */
#define GMAC_CBSCR_QBE_Msk                    (_UINT32_(0x1) << GMAC_CBSCR_QBE_Pos)                /* (GMAC_CBSCR) Queue B CBS Enable Mask */
#define GMAC_CBSCR_QBE(value)                 (GMAC_CBSCR_QBE_Msk & (_UINT32_(value) << GMAC_CBSCR_QBE_Pos)) /* Assigment of value for QBE in the GMAC_CBSCR register */
#define   GMAC_CBSCR_QBE_0_Val                _UINT32_(0x0)                                        /* (GMAC_CBSCR) Credit-based shaping on the highest priority queue (queue B) is disabled.  */
#define   GMAC_CBSCR_QBE_1_Val                _UINT32_(0x1)                                        /* (GMAC_CBSCR) Credit-based shaping on the highest priority queue (queue B) is enabled.  */
#define GMAC_CBSCR_QBE_0                      (GMAC_CBSCR_QBE_0_Val << GMAC_CBSCR_QBE_Pos)         /* (GMAC_CBSCR) Credit-based shaping on the highest priority queue (queue B) is disabled. Position  */
#define GMAC_CBSCR_QBE_1                      (GMAC_CBSCR_QBE_1_Val << GMAC_CBSCR_QBE_Pos)         /* (GMAC_CBSCR) Credit-based shaping on the highest priority queue (queue B) is enabled. Position  */
#define GMAC_CBSCR_Msk                        _UINT32_(0x00000003)                                 /* (GMAC_CBSCR) Register Mask  */


/* -------- GMAC_CBSISQA : (GMAC Offset: 0x4C0) (R/W 32) Credit-Based Shaping IdleSlope Register for Queue A -------- */
#define GMAC_CBSISQA_RESETVALUE               _UINT32_(0x00)                                       /*  (GMAC_CBSISQA) Credit-Based Shaping IdleSlope Register for Queue A  Reset Value */

#define GMAC_CBSISQA_IS_Pos                   _UINT32_(0)                                          /* (GMAC_CBSISQA) IdleSlope Position */
#define GMAC_CBSISQA_IS_Msk                   (_UINT32_(0xFFFFFFFF) << GMAC_CBSISQA_IS_Pos)        /* (GMAC_CBSISQA) IdleSlope Mask */
#define GMAC_CBSISQA_IS(value)                (GMAC_CBSISQA_IS_Msk & (_UINT32_(value) << GMAC_CBSISQA_IS_Pos)) /* Assigment of value for IS in the GMAC_CBSISQA register */
#define GMAC_CBSISQA_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (GMAC_CBSISQA) Register Mask  */


/* -------- GMAC_CBSISQB : (GMAC Offset: 0x4C4) (R/W 32) Credit-Based Shaping IdleSlope Register for Queue B -------- */
#define GMAC_CBSISQB_RESETVALUE               _UINT32_(0x00)                                       /*  (GMAC_CBSISQB) Credit-Based Shaping IdleSlope Register for Queue B  Reset Value */

#define GMAC_CBSISQB_IS_Pos                   _UINT32_(0)                                          /* (GMAC_CBSISQB) IdleSlope Position */
#define GMAC_CBSISQB_IS_Msk                   (_UINT32_(0xFFFFFFFF) << GMAC_CBSISQB_IS_Pos)        /* (GMAC_CBSISQB) IdleSlope Mask */
#define GMAC_CBSISQB_IS(value)                (GMAC_CBSISQB_IS_Msk & (_UINT32_(value) << GMAC_CBSISQB_IS_Pos)) /* Assigment of value for IS in the GMAC_CBSISQB register */
#define GMAC_CBSISQB_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (GMAC_CBSISQB) Register Mask  */


