Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/gmac.h
/* -------- GMAC_TQUBA : (GMAC Offset: 0x4C8) (R/W 32) 32 MSB Transmit Buffer Descriptor Queue Base Address Register -------- */
#define GMAC_TQUBA_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_TQUBA) 32 MSB Transmit Buffer Descriptor Queue Base Address Register  Reset Value */

#define GMAC_TQUBA_TQUBA_Pos                  _UINT32_(0)                                          /* (GMAC_TQUBA) Transmit Queue Upper Buffer Address Position */
#define GMAC_TQUBA_TQUBA_Msk                  (_UINT32_(0xFFFFFFFF) << GMAC_TQUBA_TQUBA_Pos)       /* (GMAC_TQUBA) Transmit Queue Upper Buffer Address Mask */
#define GMAC_TQUBA_TQUBA(value)               (GMAC_TQUBA_TQUBA_Msk & (_UINT32_(value) << GMAC_TQUBA_TQUBA_Pos)) /* Assigment of value for TQUBA in the GMAC_TQUBA register */
#define GMAC_TQUBA_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (GMAC_TQUBA) Register Mask  */


/* -------- GMAC_TXBDCTRL : (GMAC Offset: 0x4CC) (R/W 32) Transmit Buffer Data Control Register -------- */
#define GMAC_TXBDCTRL_RESETVALUE              _UINT32_(0x00)                                       /*  (GMAC_TXBDCTRL) Transmit Buffer Data Control Register  Reset Value */

#define GMAC_TXBDCTRL_TSMODE_Pos              _UINT32_(4)                                          /* (GMAC_TXBDCTRL) Transmit Descriptor Timestamp Insertion Mode Position */
#define GMAC_TXBDCTRL_TSMODE_Msk              (_UINT32_(0x3) << GMAC_TXBDCTRL_TSMODE_Pos)          /* (GMAC_TXBDCTRL) Transmit Descriptor Timestamp Insertion Mode Mask */
#define GMAC_TXBDCTRL_TSMODE(value)           (GMAC_TXBDCTRL_TSMODE_Msk & (_UINT32_(value) << GMAC_TXBDCTRL_TSMODE_Pos)) /* Assigment of value for TSMODE in the GMAC_TXBDCTRL register */
#define   GMAC_TXBDCTRL_TSMODE_DISABLE_Val    _UINT32_(0x0)                                        /* (GMAC_TXBDCTRL) Timestamp insertion disable.  */
#define   GMAC_TXBDCTRL_TSMODE_PTPEVENT_Val   _UINT32_(0x1)                                        /* (GMAC_TXBDCTRL) Timestamp inserted for PTP Event Frames only.  */
#define   GMAC_TXBDCTRL_TSMODE_PTPALL_Val     _UINT32_(0x2)                                        /* (GMAC_TXBDCTRL) Timestamp inserted for All PTP Frames only.  */
#define   GMAC_TXBDCTRL_TSMODE_ALL_Val        _UINT32_(0x3)                                        /* (GMAC_TXBDCTRL) Timestamp inserted for All Frames.  */
#define GMAC_TXBDCTRL_TSMODE_DISABLE          (GMAC_TXBDCTRL_TSMODE_DISABLE_Val << GMAC_TXBDCTRL_TSMODE_Pos) /* (GMAC_TXBDCTRL) Timestamp insertion disable. Position  */
#define GMAC_TXBDCTRL_TSMODE_PTPEVENT         (GMAC_TXBDCTRL_TSMODE_PTPEVENT_Val << GMAC_TXBDCTRL_TSMODE_Pos) /* (GMAC_TXBDCTRL) Timestamp inserted for PTP Event Frames only. Position  */
#define GMAC_TXBDCTRL_TSMODE_PTPALL           (GMAC_TXBDCTRL_TSMODE_PTPALL_Val << GMAC_TXBDCTRL_TSMODE_Pos) /* (GMAC_TXBDCTRL) Timestamp inserted for All PTP Frames only. Position  */
#define GMAC_TXBDCTRL_TSMODE_ALL              (GMAC_TXBDCTRL_TSMODE_ALL_Val << GMAC_TXBDCTRL_TSMODE_Pos) /* (GMAC_TXBDCTRL) Timestamp inserted for All Frames. Position  */
#define GMAC_TXBDCTRL_Msk                     _UINT32_(0x00000030)                                 /* (GMAC_TXBDCTRL) Register Mask  */


/* -------- GMAC_RXBDCTRL : (GMAC Offset: 0x4D0) (R/W 32) Receive Buffer Data Control Register -------- */
#define GMAC_RXBDCTRL_RESETVALUE              _UINT32_(0x00)                                       /*  (GMAC_RXBDCTRL) Receive Buffer Data Control Register  Reset Value */

#define GMAC_RXBDCTRL_TSMODE_Pos              _UINT32_(4)                                          /* (GMAC_RXBDCTRL) Receive Descriptor Timestamp Insertion Mode Position */
#define GMAC_RXBDCTRL_TSMODE_Msk              (_UINT32_(0x3) << GMAC_RXBDCTRL_TSMODE_Pos)          /* (GMAC_RXBDCTRL) Receive Descriptor Timestamp Insertion Mode Mask */
#define GMAC_RXBDCTRL_TSMODE(value)           (GMAC_RXBDCTRL_TSMODE_Msk & (_UINT32_(value) << GMAC_RXBDCTRL_TSMODE_Pos)) /* Assigment of value for TSMODE in the GMAC_RXBDCTRL register */
#define   GMAC_RXBDCTRL_TSMODE_DISABLE_Val    _UINT32_(0x0)                                        /* (GMAC_RXBDCTRL) Timestamp insertion disable.  */
#define   GMAC_RXBDCTRL_TSMODE_PTPEVENT_Val   _UINT32_(0x1)                                        /* (GMAC_RXBDCTRL) Timestamp inserted for PTP Event Frames only.  */
#define   GMAC_RXBDCTRL_TSMODE_PTPALL_Val     _UINT32_(0x2)                                        /* (GMAC_RXBDCTRL) Timestamp inserted for All PTP Frames only.  */
#define   GMAC_RXBDCTRL_TSMODE_ALL_Val        _UINT32_(0x3)                                        /* (GMAC_RXBDCTRL) Timestamp inserted for All Frames.  */
#define GMAC_RXBDCTRL_TSMODE_DISABLE          (GMAC_RXBDCTRL_TSMODE_DISABLE_Val << GMAC_RXBDCTRL_TSMODE_Pos) /* (GMAC_RXBDCTRL) Timestamp insertion disable. Position  */
#define GMAC_RXBDCTRL_TSMODE_PTPEVENT         (GMAC_RXBDCTRL_TSMODE_PTPEVENT_Val << GMAC_RXBDCTRL_TSMODE_Pos) /* (GMAC_RXBDCTRL) Timestamp inserted for PTP Event Frames only. Position  */
#define GMAC_RXBDCTRL_TSMODE_PTPALL           (GMAC_RXBDCTRL_TSMODE_PTPALL_Val << GMAC_RXBDCTRL_TSMODE_Pos) /* (GMAC_RXBDCTRL) Timestamp inserted for All PTP Frames only. Position  */
#define GMAC_RXBDCTRL_TSMODE_ALL              (GMAC_RXBDCTRL_TSMODE_ALL_Val << GMAC_RXBDCTRL_TSMODE_Pos) /* (GMAC_RXBDCTRL) Timestamp inserted for All Frames. Position  */
#define GMAC_RXBDCTRL_Msk                     _UINT32_(0x00000030)                                 /* (GMAC_RXBDCTRL) Register Mask  */


/* -------- GMAC_RQUBA : (GMAC Offset: 0x4D4) (R/W 32) 32 MSB Receive Buffer Descriptor Queue Base Address Register -------- */
#define GMAC_RQUBA_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_RQUBA) 32 MSB Receive Buffer Descriptor Queue Base Address Register  Reset Value */

#define GMAC_RQUBA_RQUBA_Pos                  _UINT32_(0)                                          /* (GMAC_RQUBA) Receive Queue Upper Buffer Address Position */
#define GMAC_RQUBA_RQUBA_Msk                  (_UINT32_(0xFFFFFFFF) << GMAC_RQUBA_RQUBA_Pos)       /* (GMAC_RQUBA) Receive Queue Upper Buffer Address Mask */
#define GMAC_RQUBA_RQUBA(value)               (GMAC_RQUBA_RQUBA_Msk & (_UINT32_(value) << GMAC_RQUBA_RQUBA_Pos)) /* Assigment of value for RQUBA in the GMAC_RQUBA register */
#define GMAC_RQUBA_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (GMAC_RQUBA) Register Mask  */


/* -------- GMAC_ST1RPQ : (GMAC Offset: 0x500) (R/W 32) Screening Type 1 Register Priority Queue (index = 0) -------- */
#define GMAC_ST1RPQ_RESETVALUE                _UINT32_(0x00)                                       /*  (GMAC_ST1RPQ) Screening Type 1 Register Priority Queue (index = 0)  Reset Value */

