Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/gmac.h
#define GMAC_ST1RPQ_QNB_Pos                   _UINT32_(0)                                          /* (GMAC_ST1RPQ) Queue Number (0-2) Position */
#define GMAC_ST1RPQ_QNB_Msk                   (_UINT32_(0x7) << GMAC_ST1RPQ_QNB_Pos)               /* (GMAC_ST1RPQ) Queue Number (0-2) Mask */
#define GMAC_ST1RPQ_QNB(value)                (GMAC_ST1RPQ_QNB_Msk & (_UINT32_(value) << GMAC_ST1RPQ_QNB_Pos)) /* Assigment of value for QNB in the GMAC_ST1RPQ register */
#define GMAC_ST1RPQ_DSTCM_Pos                 _UINT32_(4)                                          /* (GMAC_ST1RPQ) Differentiated Services or Traffic Class Match Position */
#define GMAC_ST1RPQ_DSTCM_Msk                 (_UINT32_(0xFF) << GMAC_ST1RPQ_DSTCM_Pos)            /* (GMAC_ST1RPQ) Differentiated Services or Traffic Class Match Mask */
#define GMAC_ST1RPQ_DSTCM(value)              (GMAC_ST1RPQ_DSTCM_Msk & (_UINT32_(value) << GMAC_ST1RPQ_DSTCM_Pos)) /* Assigment of value for DSTCM in the GMAC_ST1RPQ register */
#define GMAC_ST1RPQ_UDPM_Pos                  _UINT32_(12)                                         /* (GMAC_ST1RPQ) UDP Port Match Position */
#define GMAC_ST1RPQ_UDPM_Msk                  (_UINT32_(0xFFFF) << GMAC_ST1RPQ_UDPM_Pos)           /* (GMAC_ST1RPQ) UDP Port Match Mask */
#define GMAC_ST1RPQ_UDPM(value)               (GMAC_ST1RPQ_UDPM_Msk & (_UINT32_(value) << GMAC_ST1RPQ_UDPM_Pos)) /* Assigment of value for UDPM in the GMAC_ST1RPQ register */
#define GMAC_ST1RPQ_DSTCE_Pos                 _UINT32_(28)                                         /* (GMAC_ST1RPQ) Differentiated Services or Traffic Class Match Enable Position */
#define GMAC_ST1RPQ_DSTCE_Msk                 (_UINT32_(0x1) << GMAC_ST1RPQ_DSTCE_Pos)             /* (GMAC_ST1RPQ) Differentiated Services or Traffic Class Match Enable Mask */
#define GMAC_ST1RPQ_DSTCE(value)              (GMAC_ST1RPQ_DSTCE_Msk & (_UINT32_(value) << GMAC_ST1RPQ_DSTCE_Pos)) /* Assigment of value for DSTCE in the GMAC_ST1RPQ register */
#define GMAC_ST1RPQ_UDPE_Pos                  _UINT32_(29)                                         /* (GMAC_ST1RPQ) UDP Port Match Enable Position */
#define GMAC_ST1RPQ_UDPE_Msk                  (_UINT32_(0x1) << GMAC_ST1RPQ_UDPE_Pos)              /* (GMAC_ST1RPQ) UDP Port Match Enable Mask */
#define GMAC_ST1RPQ_UDPE(value)               (GMAC_ST1RPQ_UDPE_Msk & (_UINT32_(value) << GMAC_ST1RPQ_UDPE_Pos)) /* Assigment of value for UDPE in the GMAC_ST1RPQ register */
#define GMAC_ST1RPQ_Msk                       _UINT32_(0x3FFFFFF7)                                 /* (GMAC_ST1RPQ) Register Mask  */


/* -------- GMAC_ST2RPQ : (GMAC Offset: 0x540) (R/W 32) Screening Type 2 Register Priority Queue (index = 0) -------- */
#define GMAC_ST2RPQ_RESETVALUE                _UINT32_(0x00)                                       /*  (GMAC_ST2RPQ) Screening Type 2 Register Priority Queue (index = 0)  Reset Value */

#define GMAC_ST2RPQ_QNB_Pos                   _UINT32_(0)                                          /* (GMAC_ST2RPQ) Queue Number (0-2) Position */
#define GMAC_ST2RPQ_QNB_Msk                   (_UINT32_(0x7) << GMAC_ST2RPQ_QNB_Pos)               /* (GMAC_ST2RPQ) Queue Number (0-2) Mask */
#define GMAC_ST2RPQ_QNB(value)                (GMAC_ST2RPQ_QNB_Msk & (_UINT32_(value) << GMAC_ST2RPQ_QNB_Pos)) /* Assigment of value for QNB in the GMAC_ST2RPQ register */
#define GMAC_ST2RPQ_VLANP_Pos                 _UINT32_(4)                                          /* (GMAC_ST2RPQ) VLAN Priority Position */
#define GMAC_ST2RPQ_VLANP_Msk                 (_UINT32_(0x7) << GMAC_ST2RPQ_VLANP_Pos)             /* (GMAC_ST2RPQ) VLAN Priority Mask */
#define GMAC_ST2RPQ_VLANP(value)              (GMAC_ST2RPQ_VLANP_Msk & (_UINT32_(value) << GMAC_ST2RPQ_VLANP_Pos)) /* Assigment of value for VLANP in the GMAC_ST2RPQ register */
#define GMAC_ST2RPQ_VLANE_Pos                 _UINT32_(8)                                          /* (GMAC_ST2RPQ) VLAN Enable Position */
#define GMAC_ST2RPQ_VLANE_Msk                 (_UINT32_(0x1) << GMAC_ST2RPQ_VLANE_Pos)             /* (GMAC_ST2RPQ) VLAN Enable Mask */
#define GMAC_ST2RPQ_VLANE(value)              (GMAC_ST2RPQ_VLANE_Msk & (_UINT32_(value) << GMAC_ST2RPQ_VLANE_Pos)) /* Assigment of value for VLANE in the GMAC_ST2RPQ register */
#define   GMAC_ST2RPQ_VLANE_0_Val             _UINT32_(0x0)                                        /* (GMAC_ST2RPQ) VLAN match is disabled.  */
#define   GMAC_ST2RPQ_VLANE_1_Val             _UINT32_(0x1)                                        /* (GMAC_ST2RPQ) VLAN match is enabled.  */
#define GMAC_ST2RPQ_VLANE_0                   (GMAC_ST2RPQ_VLANE_0_Val << GMAC_ST2RPQ_VLANE_Pos)   /* (GMAC_ST2RPQ) VLAN match is disabled. Position  */
#define GMAC_ST2RPQ_VLANE_1                   (GMAC_ST2RPQ_VLANE_1_Val << GMAC_ST2RPQ_VLANE_Pos)   /* (GMAC_ST2RPQ) VLAN match is enabled. Position  */
#define GMAC_ST2RPQ_I2ETH_Pos                 _UINT32_(9)                                          /* (GMAC_ST2RPQ) Index of Screening Type 2 EtherType register Position */
#define GMAC_ST2RPQ_I2ETH_Msk                 (_UINT32_(0x7) << GMAC_ST2RPQ_I2ETH_Pos)             /* (GMAC_ST2RPQ) Index of Screening Type 2 EtherType register Mask */
#define GMAC_ST2RPQ_I2ETH(value)              (GMAC_ST2RPQ_I2ETH_Msk & (_UINT32_(value) << GMAC_ST2RPQ_I2ETH_Pos)) /* Assigment of value for I2ETH in the GMAC_ST2RPQ register */
#define GMAC_ST2RPQ_ETHE_Pos                  _UINT32_(12)                                         /* (GMAC_ST2RPQ) EtherType Enable Position */
#define GMAC_ST2RPQ_ETHE_Msk                  (_UINT32_(0x1) << GMAC_ST2RPQ_ETHE_Pos)              /* (GMAC_ST2RPQ) EtherType Enable Mask */
#define GMAC_ST2RPQ_ETHE(value)               (GMAC_ST2RPQ_ETHE_Msk & (_UINT32_(value) << GMAC_ST2RPQ_ETHE_Pos)) /* Assigment of value for ETHE in the GMAC_ST2RPQ register */
#define   GMAC_ST2RPQ_ETHE_0_Val              _UINT32_(0x0)                                        /* (GMAC_ST2RPQ) EtherType match with bits 15:0 in the register designated by the value of I2ETH is disabled.  */
#define   GMAC_ST2RPQ_ETHE_1_Val              _UINT32_(0x1)                                        /* (GMAC_ST2RPQ) EtherType match with bits 15:0 in the register designated by the value of I2ETH is enabled.  */
#define GMAC_ST2RPQ_ETHE_0                    (GMAC_ST2RPQ_ETHE_0_Val << GMAC_ST2RPQ_ETHE_Pos)     /* (GMAC_ST2RPQ) EtherType match with bits 15:0 in the register designated by the value of I2ETH is disabled. Position  */
#define GMAC_ST2RPQ_ETHE_1                    (GMAC_ST2RPQ_ETHE_1_Val << GMAC_ST2RPQ_ETHE_Pos)     /* (GMAC_ST2RPQ) EtherType match with bits 15:0 in the register designated by the value of I2ETH is enabled. Position  */
#define GMAC_ST2RPQ_COMPA_Pos                 _UINT32_(13)                                         /* (GMAC_ST2RPQ) Index of Screening Type 2 Compare Word 0/Word 1 register Position */
#define GMAC_ST2RPQ_COMPA_Msk                 (_UINT32_(0x1F) << GMAC_ST2RPQ_COMPA_Pos)            /* (GMAC_ST2RPQ) Index of Screening Type 2 Compare Word 0/Word 1 register Mask */
#define GMAC_ST2RPQ_COMPA(value)              (GMAC_ST2RPQ_COMPA_Msk & (_UINT32_(value) << GMAC_ST2RPQ_COMPA_Pos)) /* Assigment of value for COMPA in the GMAC_ST2RPQ register */
#define GMAC_ST2RPQ_COMPAE_Pos                _UINT32_(18)                                         /* (GMAC_ST2RPQ) Compare A Enable Position */
#define GMAC_ST2RPQ_COMPAE_Msk                (_UINT32_(0x1) << GMAC_ST2RPQ_COMPAE_Pos)            /* (GMAC_ST2RPQ) Compare A Enable Mask */
#define GMAC_ST2RPQ_COMPAE(value)             (GMAC_ST2RPQ_COMPAE_Msk & (_UINT32_(value) << GMAC_ST2RPQ_COMPAE_Pos)) /* Assigment of value for COMPAE in the GMAC_ST2RPQ register */
#define   GMAC_ST2RPQ_COMPAE_0_Val            _UINT32_(0x0)                                        /* (GMAC_ST2RPQ) Comparison via the register designated by index COMPA is disabled.  */
#define   GMAC_ST2RPQ_COMPAE_1_Val            _UINT32_(0x1)                                        /* (GMAC_ST2RPQ) Comparison via the register designated by index COMPA is enabled.  */
#define GMAC_ST2RPQ_COMPAE_0                  (GMAC_ST2RPQ_COMPAE_0_Val << GMAC_ST2RPQ_COMPAE_Pos) /* (GMAC_ST2RPQ) Comparison via the register designated by index COMPA is disabled. Position  */
#define GMAC_ST2RPQ_COMPAE_1                  (GMAC_ST2RPQ_COMPAE_1_Val << GMAC_ST2RPQ_COMPAE_Pos) /* (GMAC_ST2RPQ) Comparison via the register designated by index COMPA is enabled. Position  */
#define GMAC_ST2RPQ_COMPB_Pos                 _UINT32_(19)                                         /* (GMAC_ST2RPQ) Index of Screening Type 2 Compare Word 0/Word 1 register Position */
#define GMAC_ST2RPQ_COMPB_Msk                 (_UINT32_(0x1F) << GMAC_ST2RPQ_COMPB_Pos)            /* (GMAC_ST2RPQ) Index of Screening Type 2 Compare Word 0/Word 1 register Mask */
#define GMAC_ST2RPQ_COMPB(value)              (GMAC_ST2RPQ_COMPB_Msk & (_UINT32_(value) << GMAC_ST2RPQ_COMPB_Pos)) /* Assigment of value for COMPB in the GMAC_ST2RPQ register */
#define GMAC_ST2RPQ_COMPBE_Pos                _UINT32_(24)                                         /* (GMAC_ST2RPQ) Compare B Enable Position */
#define GMAC_ST2RPQ_COMPBE_Msk                (_UINT32_(0x1) << GMAC_ST2RPQ_COMPBE_Pos)            /* (GMAC_ST2RPQ) Compare B Enable Mask */
#define GMAC_ST2RPQ_COMPBE(value)             (GMAC_ST2RPQ_COMPBE_Msk & (_UINT32_(value) << GMAC_ST2RPQ_COMPBE_Pos)) /* Assigment of value for COMPBE in the GMAC_ST2RPQ register */
#define   GMAC_ST2RPQ_COMPBE_0_Val            _UINT32_(0x0)                                        /* (GMAC_ST2RPQ) Comparison via the register designated by index COMPB is disabled.  */
#define   GMAC_ST2RPQ_COMPBE_1_Val            _UINT32_(0x1)                                        /* (GMAC_ST2RPQ) Comparison via the register designated by index COMPB is enabled.  */
#define GMAC_ST2RPQ_COMPBE_0                  (GMAC_ST2RPQ_COMPBE_0_Val << GMAC_ST2RPQ_COMPBE_Pos) /* (GMAC_ST2RPQ) Comparison via the register designated by index COMPB is disabled. Position  */
#define GMAC_ST2RPQ_COMPBE_1                  (GMAC_ST2RPQ_COMPBE_1_Val << GMAC_ST2RPQ_COMPBE_Pos) /* (GMAC_ST2RPQ) Comparison via the register designated by index COMPB is enabled. Position  */
#define GMAC_ST2RPQ_COMPC_Pos                 _UINT32_(25)                                         /* (GMAC_ST2RPQ) Index of Screening Type 2 Compare Word 0/Word 1 register Position */
#define GMAC_ST2RPQ_COMPC_Msk                 (_UINT32_(0x1F) << GMAC_ST2RPQ_COMPC_Pos)            /* (GMAC_ST2RPQ) Index of Screening Type 2 Compare Word 0/Word 1 register Mask */
#define GMAC_ST2RPQ_COMPC(value)              (GMAC_ST2RPQ_COMPC_Msk & (_UINT32_(value) << GMAC_ST2RPQ_COMPC_Pos)) /* Assigment of value for COMPC in the GMAC_ST2RPQ register */
#define GMAC_ST2RPQ_COMPCE_Pos                _UINT32_(30)                                         /* (GMAC_ST2RPQ) Compare C Enable Position */
#define GMAC_ST2RPQ_COMPCE_Msk                (_UINT32_(0x1) << GMAC_ST2RPQ_COMPCE_Pos)            /* (GMAC_ST2RPQ) Compare C Enable Mask */
#define GMAC_ST2RPQ_COMPCE(value)             (GMAC_ST2RPQ_COMPCE_Msk & (_UINT32_(value) << GMAC_ST2RPQ_COMPCE_Pos)) /* Assigment of value for COMPCE in the GMAC_ST2RPQ register */
#define   GMAC_ST2RPQ_COMPCE_0_Val            _UINT32_(0x0)                                        /* (GMAC_ST2RPQ) Comparison via the register designated by index COMPC is disabled.  */
#define   GMAC_ST2RPQ_COMPCE_1_Val            _UINT32_(0x1)                                        /* (GMAC_ST2RPQ) Comparison via the register designated by index COMPC is enabled.  */
#define GMAC_ST2RPQ_COMPCE_0                  (GMAC_ST2RPQ_COMPCE_0_Val << GMAC_ST2RPQ_COMPCE_Pos) /* (GMAC_ST2RPQ) Comparison via the register designated by index COMPC is disabled. Position  */
#define GMAC_ST2RPQ_COMPCE_1                  (GMAC_ST2RPQ_COMPCE_1_Val << GMAC_ST2RPQ_COMPCE_Pos) /* (GMAC_ST2RPQ) Comparison via the register designated by index COMPC is enabled. Position  */
#define GMAC_ST2RPQ_Msk                       _UINT32_(0x7FFFFF77)                                 /* (GMAC_ST2RPQ) Register Mask  */


/* -------- GMAC_TSCTL : (GMAC Offset: 0x580) (R/W 32) Transmit Schedule Control Register -------- */
#define GMAC_TSCTL_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_TSCTL) Transmit Schedule Control Register  Reset Value */

#define GMAC_TSCTL_TXSQ0_Pos                  _UINT32_(0)                                          /* (GMAC_TSCTL) Transmit Schedule for Qx Position */
#define GMAC_TSCTL_TXSQ0_Msk                  (_UINT32_(0x3) << GMAC_TSCTL_TXSQ0_Pos)              /* (GMAC_TSCTL) Transmit Schedule for Qx Mask */
#define GMAC_TSCTL_TXSQ0(value)               (GMAC_TSCTL_TXSQ0_Msk & (_UINT32_(value) << GMAC_TSCTL_TXSQ0_Pos)) /* Assigment of value for TXSQ0 in the GMAC_TSCTL register */
#define   GMAC_TSCTL_TXSQ0_FP_Val             _UINT32_(0x0)                                        /* (GMAC_TSCTL) Fixed Priority  */
#define   GMAC_TSCTL_TXSQ0_CBS_Val            _UINT32_(0x1)                                        /* (GMAC_TSCTL) CBS Enabled only valid for top two enabled queues and if CBS capability selected.  */
#define   GMAC_TSCTL_TXSQ0_DWRR_Val           _UINT32_(0x2)                                        /* (GMAC_TSCTL) DWRR enabled  */
#define   GMAC_TSCTL_TXSQ0_ETS_Val            _UINT32_(0x3)                                        /* (GMAC_TSCTL) ETS enabled  */
#define GMAC_TSCTL_TXSQ0_FP                   (GMAC_TSCTL_TXSQ0_FP_Val << GMAC_TSCTL_TXSQ0_Pos)    /* (GMAC_TSCTL) Fixed Priority Position  */
#define GMAC_TSCTL_TXSQ0_CBS                  (GMAC_TSCTL_TXSQ0_CBS_Val << GMAC_TSCTL_TXSQ0_Pos)   /* (GMAC_TSCTL) CBS Enabled only valid for top two enabled queues and if CBS capability selected. Position  */
#define GMAC_TSCTL_TXSQ0_DWRR                 (GMAC_TSCTL_TXSQ0_DWRR_Val << GMAC_TSCTL_TXSQ0_Pos)  /* (GMAC_TSCTL) DWRR enabled Position  */
#define GMAC_TSCTL_TXSQ0_ETS                  (GMAC_TSCTL_TXSQ0_ETS_Val << GMAC_TSCTL_TXSQ0_Pos)   /* (GMAC_TSCTL) ETS enabled Position  */
#define GMAC_TSCTL_TXSQ1_Pos                  _UINT32_(2)                                          /* (GMAC_TSCTL) Transmit Schedule for Qx Position */
#define GMAC_TSCTL_TXSQ1_Msk                  (_UINT32_(0x3) << GMAC_TSCTL_TXSQ1_Pos)              /* (GMAC_TSCTL) Transmit Schedule for Qx Mask */
#define GMAC_TSCTL_TXSQ1(value)               (GMAC_TSCTL_TXSQ1_Msk & (_UINT32_(value) << GMAC_TSCTL_TXSQ1_Pos)) /* Assigment of value for TXSQ1 in the GMAC_TSCTL register */
#define   GMAC_TSCTL_TXSQ1_FP_Val             _UINT32_(0x0)                                        /* (GMAC_TSCTL) Fixed Priority  */
#define   GMAC_TSCTL_TXSQ1_CBS_Val            _UINT32_(0x1)                                        /* (GMAC_TSCTL) CBS Enabled only valid for top two enabled queues and if CBS capability selected.  */
#define   GMAC_TSCTL_TXSQ1_DWRR_Val           _UINT32_(0x2)                                        /* (GMAC_TSCTL) DWRR enabled  */
#define   GMAC_TSCTL_TXSQ1_ETS_Val            _UINT32_(0x3)                                        /* (GMAC_TSCTL) ETS enabled  */
#define GMAC_TSCTL_TXSQ1_FP                   (GMAC_TSCTL_TXSQ1_FP_Val << GMAC_TSCTL_TXSQ1_Pos)    /* (GMAC_TSCTL) Fixed Priority Position  */
#define GMAC_TSCTL_TXSQ1_CBS                  (GMAC_TSCTL_TXSQ1_CBS_Val << GMAC_TSCTL_TXSQ1_Pos)   /* (GMAC_TSCTL) CBS Enabled only valid for top two enabled queues and if CBS capability selected. Position  */
#define GMAC_TSCTL_TXSQ1_DWRR                 (GMAC_TSCTL_TXSQ1_DWRR_Val << GMAC_TSCTL_TXSQ1_Pos)  /* (GMAC_TSCTL) DWRR enabled Position  */
#define GMAC_TSCTL_TXSQ1_ETS                  (GMAC_TSCTL_TXSQ1_ETS_Val << GMAC_TSCTL_TXSQ1_Pos)   /* (GMAC_TSCTL) ETS enabled Position  */
#define GMAC_TSCTL_TXSQ2_Pos                  _UINT32_(4)                                          /* (GMAC_TSCTL) Transmit Schedule for Qx Position */
#define GMAC_TSCTL_TXSQ2_Msk                  (_UINT32_(0x3) << GMAC_TSCTL_TXSQ2_Pos)              /* (GMAC_TSCTL) Transmit Schedule for Qx Mask */
#define GMAC_TSCTL_TXSQ2(value)               (GMAC_TSCTL_TXSQ2_Msk & (_UINT32_(value) << GMAC_TSCTL_TXSQ2_Pos)) /* Assigment of value for TXSQ2 in the GMAC_TSCTL register */
#define   GMAC_TSCTL_TXSQ2_FP_Val             _UINT32_(0x0)                                        /* (GMAC_TSCTL) Fixed Priority  */
#define   GMAC_TSCTL_TXSQ2_CBS_Val            _UINT32_(0x1)                                        /* (GMAC_TSCTL) CBS Enabled only valid for top two enabled queues and if CBS capability selected.  */
#define   GMAC_TSCTL_TXSQ2_DWRR_Val           _UINT32_(0x2)                                        /* (GMAC_TSCTL) DWRR enabled  */
#define   GMAC_TSCTL_TXSQ2_ETS_Val            _UINT32_(0x3)                                        /* (GMAC_TSCTL) ETS enabled  */
#define GMAC_TSCTL_TXSQ2_FP                   (GMAC_TSCTL_TXSQ2_FP_Val << GMAC_TSCTL_TXSQ2_Pos)    /* (GMAC_TSCTL) Fixed Priority Position  */
#define GMAC_TSCTL_TXSQ2_CBS                  (GMAC_TSCTL_TXSQ2_CBS_Val << GMAC_TSCTL_TXSQ2_Pos)   /* (GMAC_TSCTL) CBS Enabled only valid for top two enabled queues and if CBS capability selected. Position  */
#define GMAC_TSCTL_TXSQ2_DWRR                 (GMAC_TSCTL_TXSQ2_DWRR_Val << GMAC_TSCTL_TXSQ2_Pos)  /* (GMAC_TSCTL) DWRR enabled Position  */
#define GMAC_TSCTL_TXSQ2_ETS                  (GMAC_TSCTL_TXSQ2_ETS_Val << GMAC_TSCTL_TXSQ2_Pos)   /* (GMAC_TSCTL) ETS enabled Position  */
#define GMAC_TSCTL_TXSQ3_Pos                  _UINT32_(6)                                          /* (GMAC_TSCTL) Transmit Schedule for Qx Position */
#define GMAC_TSCTL_TXSQ3_Msk                  (_UINT32_(0x3) << GMAC_TSCTL_TXSQ3_Pos)              /* (GMAC_TSCTL) Transmit Schedule for Qx Mask */
#define GMAC_TSCTL_TXSQ3(value)               (GMAC_TSCTL_TXSQ3_Msk & (_UINT32_(value) << GMAC_TSCTL_TXSQ3_Pos)) /* Assigment of value for TXSQ3 in the GMAC_TSCTL register */
#define   GMAC_TSCTL_TXSQ3_FP_Val             _UINT32_(0x0)                                        /* (GMAC_TSCTL) Fixed Priority  */
#define   GMAC_TSCTL_TXSQ3_CBS_Val            _UINT32_(0x1)                                        /* (GMAC_TSCTL) CBS Enabled only valid for top two enabled queues and if CBS capability selected.  */
#define   GMAC_TSCTL_TXSQ3_DWRR_Val           _UINT32_(0x2)                                        /* (GMAC_TSCTL) DWRR enabled  */
#define   GMAC_TSCTL_TXSQ3_ETS_Val            _UINT32_(0x3)                                        /* (GMAC_TSCTL) ETS enabled  */
#define GMAC_TSCTL_TXSQ3_FP                   (GMAC_TSCTL_TXSQ3_FP_Val << GMAC_TSCTL_TXSQ3_Pos)    /* (GMAC_TSCTL) Fixed Priority Position  */
#define GMAC_TSCTL_TXSQ3_CBS                  (GMAC_TSCTL_TXSQ3_CBS_Val << GMAC_TSCTL_TXSQ3_Pos)   /* (GMAC_TSCTL) CBS Enabled only valid for top two enabled queues and if CBS capability selected. Position  */
#define GMAC_TSCTL_TXSQ3_DWRR                 (GMAC_TSCTL_TXSQ3_DWRR_Val << GMAC_TSCTL_TXSQ3_Pos)  /* (GMAC_TSCTL) DWRR enabled Position  */
#define GMAC_TSCTL_TXSQ3_ETS                  (GMAC_TSCTL_TXSQ3_ETS_Val << GMAC_TSCTL_TXSQ3_Pos)   /* (GMAC_TSCTL) ETS enabled Position  */
#define GMAC_TSCTL_TXSQ4_Pos                  _UINT32_(8)                                          /* (GMAC_TSCTL) Transmit Schedule for Qx Position */
#define GMAC_TSCTL_TXSQ4_Msk                  (_UINT32_(0x3) << GMAC_TSCTL_TXSQ4_Pos)              /* (GMAC_TSCTL) Transmit Schedule for Qx Mask */
#define GMAC_TSCTL_TXSQ4(value)               (GMAC_TSCTL_TXSQ4_Msk & (_UINT32_(value) << GMAC_TSCTL_TXSQ4_Pos)) /* Assigment of value for TXSQ4 in the GMAC_TSCTL register */
#define   GMAC_TSCTL_TXSQ4_FP_Val             _UINT32_(0x0)                                        /* (GMAC_TSCTL) Fixed Priority  */
#define   GMAC_TSCTL_TXSQ4_CBS_Val            _UINT32_(0x1)                                        /* (GMAC_TSCTL) CBS Enabled only valid for top two enabled queues and if CBS capability selected.  */
#define   GMAC_TSCTL_TXSQ4_DWRR_Val           _UINT32_(0x2)                                        /* (GMAC_TSCTL) DWRR enabled  */
#define   GMAC_TSCTL_TXSQ4_ETS_Val            _UINT32_(0x3)                                        /* (GMAC_TSCTL) ETS enabled  */
#define GMAC_TSCTL_TXSQ4_FP                   (GMAC_TSCTL_TXSQ4_FP_Val << GMAC_TSCTL_TXSQ4_Pos)    /* (GMAC_TSCTL) Fixed Priority Position  */
#define GMAC_TSCTL_TXSQ4_CBS                  (GMAC_TSCTL_TXSQ4_CBS_Val << GMAC_TSCTL_TXSQ4_Pos)   /* (GMAC_TSCTL) CBS Enabled only valid for top two enabled queues and if CBS capability selected. Position  */
#define GMAC_TSCTL_TXSQ4_DWRR                 (GMAC_TSCTL_TXSQ4_DWRR_Val << GMAC_TSCTL_TXSQ4_Pos)  /* (GMAC_TSCTL) DWRR enabled Position  */
#define GMAC_TSCTL_TXSQ4_ETS                  (GMAC_TSCTL_TXSQ4_ETS_Val << GMAC_TSCTL_TXSQ4_Pos)   /* (GMAC_TSCTL) ETS enabled Position  */
#define GMAC_TSCTL_TXSQ5_Pos                  _UINT32_(10)                                         /* (GMAC_TSCTL) Transmit Schedule for Qx Position */
#define GMAC_TSCTL_TXSQ5_Msk                  (_UINT32_(0x3) << GMAC_TSCTL_TXSQ5_Pos)              /* (GMAC_TSCTL) Transmit Schedule for Qx Mask */
#define GMAC_TSCTL_TXSQ5(value)               (GMAC_TSCTL_TXSQ5_Msk & (_UINT32_(value) << GMAC_TSCTL_TXSQ5_Pos)) /* Assigment of value for TXSQ5 in the GMAC_TSCTL register */
#define   GMAC_TSCTL_TXSQ5_FP_Val             _UINT32_(0x0)                                        /* (GMAC_TSCTL) Fixed Priority  */
#define   GMAC_TSCTL_TXSQ5_CBS_Val            _UINT32_(0x1)                                        /* (GMAC_TSCTL) CBS Enabled only valid for top two enabled queues and if CBS capability selected.  */
#define   GMAC_TSCTL_TXSQ5_DWRR_Val           _UINT32_(0x2)                                        /* (GMAC_TSCTL) DWRR enabled  */
#define   GMAC_TSCTL_TXSQ5_ETS_Val            _UINT32_(0x3)                                        /* (GMAC_TSCTL) ETS enabled  */
#define GMAC_TSCTL_TXSQ5_FP                   (GMAC_TSCTL_TXSQ5_FP_Val << GMAC_TSCTL_TXSQ5_Pos)    /* (GMAC_TSCTL) Fixed Priority Position  */
#define GMAC_TSCTL_TXSQ5_CBS                  (GMAC_TSCTL_TXSQ5_CBS_Val << GMAC_TSCTL_TXSQ5_Pos)   /* (GMAC_TSCTL) CBS Enabled only valid for top two enabled queues and if CBS capability selected. Position  */
#define GMAC_TSCTL_TXSQ5_DWRR                 (GMAC_TSCTL_TXSQ5_DWRR_Val << GMAC_TSCTL_TXSQ5_Pos)  /* (GMAC_TSCTL) DWRR enabled Position  */
#define GMAC_TSCTL_TXSQ5_ETS                  (GMAC_TSCTL_TXSQ5_ETS_Val << GMAC_TSCTL_TXSQ5_Pos)   /* (GMAC_TSCTL) ETS enabled Position  */
#define GMAC_TSCTL_Msk                        _UINT32_(0x00000FFF)                                 /* (GMAC_TSCTL) Register Mask  */


/* -------- GMAC_TQBWRL0 : (GMAC Offset: 0x590) (R/W 32) Transmit Queue Bandwidth Rate Limit 0 Register -------- */
#define GMAC_TQBWRL0_RESETVALUE               _UINT32_(0x00)                                       /*  (GMAC_TQBWRL0) Transmit Queue Bandwidth Rate Limit 0 Register  Reset Value */

