Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/gmac.h
#define GMAC_TQBWRL0_ALLOCQ0_Pos              _UINT32_(0)                                          /* (GMAC_TQBWRL0) DWRR Weighting or ETS Bandwidth Allocation for Qx Position */
#define GMAC_TQBWRL0_ALLOCQ0_Msk              (_UINT32_(0xFF) << GMAC_TQBWRL0_ALLOCQ0_Pos)         /* (GMAC_TQBWRL0) DWRR Weighting or ETS Bandwidth Allocation for Qx Mask */
#define GMAC_TQBWRL0_ALLOCQ0(value)           (GMAC_TQBWRL0_ALLOCQ0_Msk & (_UINT32_(value) << GMAC_TQBWRL0_ALLOCQ0_Pos)) /* Assigment of value for ALLOCQ0 in the GMAC_TQBWRL0 register */
#define GMAC_TQBWRL0_ALLOCQ1_Pos              _UINT32_(8)                                          /* (GMAC_TQBWRL0) DWRR Weighting or ETS Bandwidth Allocation for Qx Position */
#define GMAC_TQBWRL0_ALLOCQ1_Msk              (_UINT32_(0xFF) << GMAC_TQBWRL0_ALLOCQ1_Pos)         /* (GMAC_TQBWRL0) DWRR Weighting or ETS Bandwidth Allocation for Qx Mask */
#define GMAC_TQBWRL0_ALLOCQ1(value)           (GMAC_TQBWRL0_ALLOCQ1_Msk & (_UINT32_(value) << GMAC_TQBWRL0_ALLOCQ1_Pos)) /* Assigment of value for ALLOCQ1 in the GMAC_TQBWRL0 register */
#define GMAC_TQBWRL0_ALLOCQ2_Pos              _UINT32_(16)                                         /* (GMAC_TQBWRL0) DWRR Weighting or ETS Bandwidth Allocation for Qx Position */
#define GMAC_TQBWRL0_ALLOCQ2_Msk              (_UINT32_(0xFF) << GMAC_TQBWRL0_ALLOCQ2_Pos)         /* (GMAC_TQBWRL0) DWRR Weighting or ETS Bandwidth Allocation for Qx Mask */
#define GMAC_TQBWRL0_ALLOCQ2(value)           (GMAC_TQBWRL0_ALLOCQ2_Msk & (_UINT32_(value) << GMAC_TQBWRL0_ALLOCQ2_Pos)) /* Assigment of value for ALLOCQ2 in the GMAC_TQBWRL0 register */
#define GMAC_TQBWRL0_ALLOCQ3_Pos              _UINT32_(24)                                         /* (GMAC_TQBWRL0) DWRR Weighting or ETS Bandwidth Allocation for Qx Position */
#define GMAC_TQBWRL0_ALLOCQ3_Msk              (_UINT32_(0xFF) << GMAC_TQBWRL0_ALLOCQ3_Pos)         /* (GMAC_TQBWRL0) DWRR Weighting or ETS Bandwidth Allocation for Qx Mask */
#define GMAC_TQBWRL0_ALLOCQ3(value)           (GMAC_TQBWRL0_ALLOCQ3_Msk & (_UINT32_(value) << GMAC_TQBWRL0_ALLOCQ3_Pos)) /* Assigment of value for ALLOCQ3 in the GMAC_TQBWRL0 register */
#define GMAC_TQBWRL0_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (GMAC_TQBWRL0) Register Mask  */


/* -------- GMAC_TQSA : (GMAC Offset: 0x5A0) (R/W 32) Transmit Queue Segment Allocation Register -------- */
#define GMAC_TQSA_RESETVALUE                  _UINT32_(0x00)                                       /*  (GMAC_TQSA) Transmit Queue Segment Allocation Register  Reset Value */

#define GMAC_TQSA_SEGALLOCQ0_Pos              _UINT32_(0)                                          /* (GMAC_TQSA) Segment Allocation for Qx Position */
#define GMAC_TQSA_SEGALLOCQ0_Msk              (_UINT32_(0x7) << GMAC_TQSA_SEGALLOCQ0_Pos)          /* (GMAC_TQSA) Segment Allocation for Qx Mask */
#define GMAC_TQSA_SEGALLOCQ0(value)           (GMAC_TQSA_SEGALLOCQ0_Msk & (_UINT32_(value) << GMAC_TQSA_SEGALLOCQ0_Pos)) /* Assigment of value for SEGALLOCQ0 in the GMAC_TQSA register */
#define GMAC_TQSA_SEGALLOCQ1_Pos              _UINT32_(4)                                          /* (GMAC_TQSA) Segment Allocation for Qx Position */
#define GMAC_TQSA_SEGALLOCQ1_Msk              (_UINT32_(0x7) << GMAC_TQSA_SEGALLOCQ1_Pos)          /* (GMAC_TQSA) Segment Allocation for Qx Mask */
#define GMAC_TQSA_SEGALLOCQ1(value)           (GMAC_TQSA_SEGALLOCQ1_Msk & (_UINT32_(value) << GMAC_TQSA_SEGALLOCQ1_Pos)) /* Assigment of value for SEGALLOCQ1 in the GMAC_TQSA register */
#define GMAC_TQSA_SEGALLOCQ2_Pos              _UINT32_(8)                                          /* (GMAC_TQSA) Segment Allocation for Qx Position */
#define GMAC_TQSA_SEGALLOCQ2_Msk              (_UINT32_(0x7) << GMAC_TQSA_SEGALLOCQ2_Pos)          /* (GMAC_TQSA) Segment Allocation for Qx Mask */
#define GMAC_TQSA_SEGALLOCQ2(value)           (GMAC_TQSA_SEGALLOCQ2_Msk & (_UINT32_(value) << GMAC_TQSA_SEGALLOCQ2_Pos)) /* Assigment of value for SEGALLOCQ2 in the GMAC_TQSA register */
#define GMAC_TQSA_SEGALLOCQ3_Pos              _UINT32_(12)                                         /* (GMAC_TQSA) Segment Allocation for Qx Position */
#define GMAC_TQSA_SEGALLOCQ3_Msk              (_UINT32_(0x7) << GMAC_TQSA_SEGALLOCQ3_Pos)          /* (GMAC_TQSA) Segment Allocation for Qx Mask */
#define GMAC_TQSA_SEGALLOCQ3(value)           (GMAC_TQSA_SEGALLOCQ3_Msk & (_UINT32_(value) << GMAC_TQSA_SEGALLOCQ3_Pos)) /* Assigment of value for SEGALLOCQ3 in the GMAC_TQSA register */
#define GMAC_TQSA_SEGALLOCQ4_Pos              _UINT32_(16)                                         /* (GMAC_TQSA) Segment Allocation for Qx Position */
#define GMAC_TQSA_SEGALLOCQ4_Msk              (_UINT32_(0x7) << GMAC_TQSA_SEGALLOCQ4_Pos)          /* (GMAC_TQSA) Segment Allocation for Qx Mask */
#define GMAC_TQSA_SEGALLOCQ4(value)           (GMAC_TQSA_SEGALLOCQ4_Msk & (_UINT32_(value) << GMAC_TQSA_SEGALLOCQ4_Pos)) /* Assigment of value for SEGALLOCQ4 in the GMAC_TQSA register */
#define GMAC_TQSA_SEGALLOCQ5_Pos              _UINT32_(20)                                         /* (GMAC_TQSA) Segment Allocation for Qx Position */
#define GMAC_TQSA_SEGALLOCQ5_Msk              (_UINT32_(0x7) << GMAC_TQSA_SEGALLOCQ5_Pos)          /* (GMAC_TQSA) Segment Allocation for Qx Mask */
#define GMAC_TQSA_SEGALLOCQ5(value)           (GMAC_TQSA_SEGALLOCQ5_Msk & (_UINT32_(value) << GMAC_TQSA_SEGALLOCQ5_Pos)) /* Assigment of value for SEGALLOCQ5 in the GMAC_TQSA register */
#define GMAC_TQSA_Msk                         _UINT32_(0x00777777)                                 /* (GMAC_TQSA) Register Mask  */


/* -------- GMAC_IERPQ : (GMAC Offset: 0x600) ( /W 32) Interrupt Enable Register Priority Queue (index = 1) -------- */
#define GMAC_IERPQ_RCOMP_Pos                  _UINT32_(1)                                          /* (GMAC_IERPQ) Receive Complete Position */
#define GMAC_IERPQ_RCOMP_Msk                  (_UINT32_(0x1) << GMAC_IERPQ_RCOMP_Pos)              /* (GMAC_IERPQ) Receive Complete Mask */
#define GMAC_IERPQ_RCOMP(value)               (GMAC_IERPQ_RCOMP_Msk & (_UINT32_(value) << GMAC_IERPQ_RCOMP_Pos)) /* Assigment of value for RCOMP in the GMAC_IERPQ register */
#define GMAC_IERPQ_RXUBR_Pos                  _UINT32_(2)                                          /* (GMAC_IERPQ) RX Used Bit Read Position */
#define GMAC_IERPQ_RXUBR_Msk                  (_UINT32_(0x1) << GMAC_IERPQ_RXUBR_Pos)              /* (GMAC_IERPQ) RX Used Bit Read Mask */
#define GMAC_IERPQ_RXUBR(value)               (GMAC_IERPQ_RXUBR_Msk & (_UINT32_(value) << GMAC_IERPQ_RXUBR_Pos)) /* Assigment of value for RXUBR in the GMAC_IERPQ register */
#define GMAC_IERPQ_RLEX_Pos                   _UINT32_(5)                                          /* (GMAC_IERPQ) Retry Limit Exceeded or Late Collision Position */
#define GMAC_IERPQ_RLEX_Msk                   (_UINT32_(0x1) << GMAC_IERPQ_RLEX_Pos)               /* (GMAC_IERPQ) Retry Limit Exceeded or Late Collision Mask */
#define GMAC_IERPQ_RLEX(value)                (GMAC_IERPQ_RLEX_Msk & (_UINT32_(value) << GMAC_IERPQ_RLEX_Pos)) /* Assigment of value for RLEX in the GMAC_IERPQ register */
#define GMAC_IERPQ_TFC_Pos                    _UINT32_(6)                                          /* (GMAC_IERPQ) Transmit Frame Corruption Due to System Bus Error Position */
#define GMAC_IERPQ_TFC_Msk                    (_UINT32_(0x1) << GMAC_IERPQ_TFC_Pos)                /* (GMAC_IERPQ) Transmit Frame Corruption Due to System Bus Error Mask */
#define GMAC_IERPQ_TFC(value)                 (GMAC_IERPQ_TFC_Msk & (_UINT32_(value) << GMAC_IERPQ_TFC_Pos)) /* Assigment of value for TFC in the GMAC_IERPQ register */
#define GMAC_IERPQ_TCOMP_Pos                  _UINT32_(7)                                          /* (GMAC_IERPQ) Transmit Complete Position */
#define GMAC_IERPQ_TCOMP_Msk                  (_UINT32_(0x1) << GMAC_IERPQ_TCOMP_Pos)              /* (GMAC_IERPQ) Transmit Complete Mask */
#define GMAC_IERPQ_TCOMP(value)               (GMAC_IERPQ_TCOMP_Msk & (_UINT32_(value) << GMAC_IERPQ_TCOMP_Pos)) /* Assigment of value for TCOMP in the GMAC_IERPQ register */
#define GMAC_IERPQ_HRESP_Pos                  _UINT32_(11)                                         /* (GMAC_IERPQ) System Bus Error Position */
#define GMAC_IERPQ_HRESP_Msk                  (_UINT32_(0x1) << GMAC_IERPQ_HRESP_Pos)              /* (GMAC_IERPQ) System Bus Error Mask */
#define GMAC_IERPQ_HRESP(value)               (GMAC_IERPQ_HRESP_Msk & (_UINT32_(value) << GMAC_IERPQ_HRESP_Pos)) /* Assigment of value for HRESP in the GMAC_IERPQ register */
#define GMAC_IERPQ_Msk                        _UINT32_(0x000008E6)                                 /* (GMAC_IERPQ) Register Mask  */


