Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/gmac.h
/* -------- GMAC_IDRPQ : (GMAC Offset: 0x620) ( /W 32) Interrupt Disable Register Priority Queue (index = 1) -------- */
#define GMAC_IDRPQ_RCOMP_Pos                  _UINT32_(1)                                          /* (GMAC_IDRPQ) Receive Complete Position */
#define GMAC_IDRPQ_RCOMP_Msk                  (_UINT32_(0x1) << GMAC_IDRPQ_RCOMP_Pos)              /* (GMAC_IDRPQ) Receive Complete Mask */
#define GMAC_IDRPQ_RCOMP(value)               (GMAC_IDRPQ_RCOMP_Msk & (_UINT32_(value) << GMAC_IDRPQ_RCOMP_Pos)) /* Assigment of value for RCOMP in the GMAC_IDRPQ register */
#define GMAC_IDRPQ_RXUBR_Pos                  _UINT32_(2)                                          /* (GMAC_IDRPQ) RX Used Bit Read Position */
#define GMAC_IDRPQ_RXUBR_Msk                  (_UINT32_(0x1) << GMAC_IDRPQ_RXUBR_Pos)              /* (GMAC_IDRPQ) RX Used Bit Read Mask */
#define GMAC_IDRPQ_RXUBR(value)               (GMAC_IDRPQ_RXUBR_Msk & (_UINT32_(value) << GMAC_IDRPQ_RXUBR_Pos)) /* Assigment of value for RXUBR in the GMAC_IDRPQ register */
#define GMAC_IDRPQ_RLEX_Pos                   _UINT32_(5)                                          /* (GMAC_IDRPQ) Retry Limit Exceeded or Late Collision Position */
#define GMAC_IDRPQ_RLEX_Msk                   (_UINT32_(0x1) << GMAC_IDRPQ_RLEX_Pos)               /* (GMAC_IDRPQ) Retry Limit Exceeded or Late Collision Mask */
#define GMAC_IDRPQ_RLEX(value)                (GMAC_IDRPQ_RLEX_Msk & (_UINT32_(value) << GMAC_IDRPQ_RLEX_Pos)) /* Assigment of value for RLEX in the GMAC_IDRPQ register */
#define GMAC_IDRPQ_TFC_Pos                    _UINT32_(6)                                          /* (GMAC_IDRPQ) Transmit Frame Corruption Due to System Bus Error Position */
#define GMAC_IDRPQ_TFC_Msk                    (_UINT32_(0x1) << GMAC_IDRPQ_TFC_Pos)                /* (GMAC_IDRPQ) Transmit Frame Corruption Due to System Bus Error Mask */
#define GMAC_IDRPQ_TFC(value)                 (GMAC_IDRPQ_TFC_Msk & (_UINT32_(value) << GMAC_IDRPQ_TFC_Pos)) /* Assigment of value for TFC in the GMAC_IDRPQ register */
#define GMAC_IDRPQ_TCOMP_Pos                  _UINT32_(7)                                          /* (GMAC_IDRPQ) Transmit Complete Position */
#define GMAC_IDRPQ_TCOMP_Msk                  (_UINT32_(0x1) << GMAC_IDRPQ_TCOMP_Pos)              /* (GMAC_IDRPQ) Transmit Complete Mask */
#define GMAC_IDRPQ_TCOMP(value)               (GMAC_IDRPQ_TCOMP_Msk & (_UINT32_(value) << GMAC_IDRPQ_TCOMP_Pos)) /* Assigment of value for TCOMP in the GMAC_IDRPQ register */
#define GMAC_IDRPQ_HRESP_Pos                  _UINT32_(11)                                         /* (GMAC_IDRPQ) System Bus Error Position */
#define GMAC_IDRPQ_HRESP_Msk                  (_UINT32_(0x1) << GMAC_IDRPQ_HRESP_Pos)              /* (GMAC_IDRPQ) System Bus Error Mask */
#define GMAC_IDRPQ_HRESP(value)               (GMAC_IDRPQ_HRESP_Msk & (_UINT32_(value) << GMAC_IDRPQ_HRESP_Pos)) /* Assigment of value for HRESP in the GMAC_IDRPQ register */
#define GMAC_IDRPQ_Msk                        _UINT32_(0x000008E6)                                 /* (GMAC_IDRPQ) Register Mask  */


/* -------- GMAC_IMRPQ : (GMAC Offset: 0x640) (R/W 32) Interrupt Mask Register Priority Queue (index = 1) -------- */
#define GMAC_IMRPQ_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_IMRPQ) Interrupt Mask Register Priority Queue (index = 1)  Reset Value */

#define GMAC_IMRPQ_RCOMP_Pos                  _UINT32_(1)                                          /* (GMAC_IMRPQ) Receive Complete Position */
#define GMAC_IMRPQ_RCOMP_Msk                  (_UINT32_(0x1) << GMAC_IMRPQ_RCOMP_Pos)              /* (GMAC_IMRPQ) Receive Complete Mask */
#define GMAC_IMRPQ_RCOMP(value)               (GMAC_IMRPQ_RCOMP_Msk & (_UINT32_(value) << GMAC_IMRPQ_RCOMP_Pos)) /* Assigment of value for RCOMP in the GMAC_IMRPQ register */
#define GMAC_IMRPQ_RXUBR_Pos                  _UINT32_(2)                                          /* (GMAC_IMRPQ) RX Used Bit Read Position */
#define GMAC_IMRPQ_RXUBR_Msk                  (_UINT32_(0x1) << GMAC_IMRPQ_RXUBR_Pos)              /* (GMAC_IMRPQ) RX Used Bit Read Mask */
#define GMAC_IMRPQ_RXUBR(value)               (GMAC_IMRPQ_RXUBR_Msk & (_UINT32_(value) << GMAC_IMRPQ_RXUBR_Pos)) /* Assigment of value for RXUBR in the GMAC_IMRPQ register */
#define GMAC_IMRPQ_RLEX_Pos                   _UINT32_(5)                                          /* (GMAC_IMRPQ) Retry Limit Exceeded or Late Collision Position */
#define GMAC_IMRPQ_RLEX_Msk                   (_UINT32_(0x1) << GMAC_IMRPQ_RLEX_Pos)               /* (GMAC_IMRPQ) Retry Limit Exceeded or Late Collision Mask */
#define GMAC_IMRPQ_RLEX(value)                (GMAC_IMRPQ_RLEX_Msk & (_UINT32_(value) << GMAC_IMRPQ_RLEX_Pos)) /* Assigment of value for RLEX in the GMAC_IMRPQ register */
#define GMAC_IMRPQ_AHB_Pos                    _UINT32_(6)                                          /* (GMAC_IMRPQ) Transmit Frame Corruption Due to System Bus Error Position */
#define GMAC_IMRPQ_AHB_Msk                    (_UINT32_(0x1) << GMAC_IMRPQ_AHB_Pos)                /* (GMAC_IMRPQ) Transmit Frame Corruption Due to System Bus Error Mask */
#define GMAC_IMRPQ_AHB(value)                 (GMAC_IMRPQ_AHB_Msk & (_UINT32_(value) << GMAC_IMRPQ_AHB_Pos)) /* Assigment of value for AHB in the GMAC_IMRPQ register */
#define GMAC_IMRPQ_TCOMP_Pos                  _UINT32_(7)                                          /* (GMAC_IMRPQ) Transmit Complete Position */
#define GMAC_IMRPQ_TCOMP_Msk                  (_UINT32_(0x1) << GMAC_IMRPQ_TCOMP_Pos)              /* (GMAC_IMRPQ) Transmit Complete Mask */
#define GMAC_IMRPQ_TCOMP(value)               (GMAC_IMRPQ_TCOMP_Msk & (_UINT32_(value) << GMAC_IMRPQ_TCOMP_Pos)) /* Assigment of value for TCOMP in the GMAC_IMRPQ register */
#define GMAC_IMRPQ_HRESP_Pos                  _UINT32_(11)                                         /* (GMAC_IMRPQ) System Bus Error Position */
#define GMAC_IMRPQ_HRESP_Msk                  (_UINT32_(0x1) << GMAC_IMRPQ_HRESP_Pos)              /* (GMAC_IMRPQ) System Bus Error Mask */
#define GMAC_IMRPQ_HRESP(value)               (GMAC_IMRPQ_HRESP_Msk & (_UINT32_(value) << GMAC_IMRPQ_HRESP_Pos)) /* Assigment of value for HRESP in the GMAC_IMRPQ register */
#define GMAC_IMRPQ_Msk                        _UINT32_(0x000008E6)                                 /* (GMAC_IMRPQ) Register Mask  */


/* -------- GMAC_ST2ER : (GMAC Offset: 0x6E0) (R/W 32) Screening Type 2 Ethertype Register (index = 0) -------- */
#define GMAC_ST2ER_RESETVALUE                 _UINT32_(0x00)                                       /*  (GMAC_ST2ER) Screening Type 2 Ethertype Register (index = 0)  Reset Value */

