Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/gmac.h
#define GMAC_ST2ER_COMPVAL_Pos                _UINT32_(0)                                          /* (GMAC_ST2ER) Ethertype Compare Value Position */
#define GMAC_ST2ER_COMPVAL_Msk                (_UINT32_(0xFFFF) << GMAC_ST2ER_COMPVAL_Pos)         /* (GMAC_ST2ER) Ethertype Compare Value Mask */
#define GMAC_ST2ER_COMPVAL(value)             (GMAC_ST2ER_COMPVAL_Msk & (_UINT32_(value) << GMAC_ST2ER_COMPVAL_Pos)) /* Assigment of value for COMPVAL in the GMAC_ST2ER register */
#define GMAC_ST2ER_Msk                        _UINT32_(0x0000FFFF)                                 /* (GMAC_ST2ER) Register Mask  */


/** \brief GMAC register offsets definitions */
#define GMAC_SAB_REG_OFST              _UINT32_(0x00)      /* (GMAC_SAB) Specific Address 1 Bottom Register Offset */
#define GMAC_SAT_REG_OFST              _UINT32_(0x04)      /* (GMAC_SAT) Specific Address 1 Top Register Offset */
#define GMAC_ST2CW0_REG_OFST           _UINT32_(0x00)      /* (GMAC_ST2CW0) Screening Type 2 Compare Word 0 Register  Offset */
#define GMAC_ST2CW1_REG_OFST           _UINT32_(0x04)      /* (GMAC_ST2CW1) Screening Type 2 Compare Word 1 Register  Offset */
#define GMAC_NCR_REG_OFST              _UINT32_(0x00)      /* (GMAC_NCR) Network Control Register Offset */
#define GMAC_NCFGR_REG_OFST            _UINT32_(0x04)      /* (GMAC_NCFGR) Network Configuration Register Offset */
#define GMAC_NSR_REG_OFST              _UINT32_(0x08)      /* (GMAC_NSR) Network Status Register Offset */
#define GMAC_UR_REG_OFST               _UINT32_(0x0C)      /* (GMAC_UR) User Register Offset */
#define GMAC_DCFGR_REG_OFST            _UINT32_(0x10)      /* (GMAC_DCFGR) DMA Configuration Register Offset */
#define GMAC_TSR_REG_OFST              _UINT32_(0x14)      /* (GMAC_TSR) Transmit Status Register Offset */
#define GMAC_RBQB_REG_OFST             _UINT32_(0x18)      /* (GMAC_RBQB) Receive Buffer Queue Base Address Register Offset */
#define GMAC_TBQB_REG_OFST             _UINT32_(0x1C)      /* (GMAC_TBQB) Transmit Buffer Queue Base Address Register Offset */
#define GMAC_RSR_REG_OFST              _UINT32_(0x20)      /* (GMAC_RSR) Receive Status Register Offset */
#define GMAC_ISR_REG_OFST              _UINT32_(0x24)      /* (GMAC_ISR) Interrupt Status Register Offset */
#define GMAC_IER_REG_OFST              _UINT32_(0x28)      /* (GMAC_IER) Interrupt Enable Register Offset */
#define GMAC_IDR_REG_OFST              _UINT32_(0x2C)      /* (GMAC_IDR) Interrupt Disable Register Offset */
#define GMAC_IMR_REG_OFST              _UINT32_(0x30)      /* (GMAC_IMR) Interrupt Mask Register Offset */
#define GMAC_MAN_REG_OFST              _UINT32_(0x34)      /* (GMAC_MAN) PHY Maintenance Register Offset */
#define GMAC_RPQ_REG_OFST              _UINT32_(0x38)      /* (GMAC_RPQ) Receive Pause Quantum Register Offset */
#define GMAC_TPQ_REG_OFST              _UINT32_(0x3C)      /* (GMAC_TPQ) Transmit Pause Quantum Register Offset */
#define GMAC_RJFML_REG_OFST            _UINT32_(0x48)      /* (GMAC_RJFML) RX Jumbo Frame Max Length Register Offset */
#define GMAC_INTM_REG_OFST             _UINT32_(0x5C)      /* (GMAC_INTM) Interrupt Moderation Register Offset */
#define GMAC_SYSWT_REG_OFST            _UINT32_(0x60)      /* (GMAC_SYSWT) System Wake-Up Time Register Offset */
#define GMAC_HRB_REG_OFST              _UINT32_(0x80)      /* (GMAC_HRB) Hash Register Bottom Offset */
#define GMAC_HRT_REG_OFST              _UINT32_(0x84)      /* (GMAC_HRT) Hash Register Top Offset */
#define GMAC_TIDM1_REG_OFST            _UINT32_(0xA8)      /* (GMAC_TIDM1) Type ID Match 1 Register Offset */
#define GMAC_TIDM2_REG_OFST            _UINT32_(0xAC)      /* (GMAC_TIDM2) Type ID Match 2 Register Offset */
#define GMAC_TIDM3_REG_OFST            _UINT32_(0xB0)      /* (GMAC_TIDM3) Type ID Match 3 Register Offset */
#define GMAC_TIDM4_REG_OFST            _UINT32_(0xB4)      /* (GMAC_TIDM4) Type ID Match 4 Register Offset */
#define GMAC_WOL_REG_OFST              _UINT32_(0xB8)      /* (GMAC_WOL) Wake on LAN Register Offset */
#define GMAC_IPGS_REG_OFST             _UINT32_(0xBC)      /* (GMAC_IPGS) IPG Stretch Register Offset */
#define GMAC_SVLAN_REG_OFST            _UINT32_(0xC0)      /* (GMAC_SVLAN) Stacked VLAN Register Offset */
#define GMAC_TPFCP_REG_OFST            _UINT32_(0xC4)      /* (GMAC_TPFCP) Transmit PFC Pause Register Offset */
#define GMAC_SAMB1_REG_OFST            _UINT32_(0xC8)      /* (GMAC_SAMB1) Specific Address 1 Mask Bottom Register Offset */
#define GMAC_SAMT1_REG_OFST            _UINT32_(0xCC)      /* (GMAC_SAMT1) Specific Address 1 Mask Top Register Offset */
#define GMAC_AMRX_REG_OFST             _UINT32_(0xD0)      /* (GMAC_AMRX) System Memory Address Mask for RX Data Buffer Accesses Register Offset */
#define GMAC_RXUDAR_REG_OFST           _UINT32_(0xD4)      /* (GMAC_RXUDAR) PTP RX Unicast IP Destination Address Register Offset */
#define GMAC_TXUDAR_REG_OFST           _UINT32_(0xD8)      /* (GMAC_TXUDAR) PTP TX Unicast IP Destination Address Register Offset */
#define GMAC_NSC_REG_OFST              _UINT32_(0xDC)      /* (GMAC_NSC) 1588 Timer Nanosecond Comparison Register Offset */
#define GMAC_SCL_REG_OFST              _UINT32_(0xE0)      /* (GMAC_SCL) 1588 Timer Second Comparison Low Register Offset */
#define GMAC_SCH_REG_OFST              _UINT32_(0xE4)      /* (GMAC_SCH) 1588 Timer Second Comparison High Register Offset */
#define GMAC_EFTSH_REG_OFST            _UINT32_(0xE8)      /* (GMAC_EFTSH) PTP Event Frame Transmitted Seconds High Register Offset */
#define GMAC_EFRSH_REG_OFST            _UINT32_(0xEC)      /* (GMAC_EFRSH) PTP Event Frame Received Seconds High Register Offset */
#define GMAC_PEFTSH_REG_OFST           _UINT32_(0xF0)      /* (GMAC_PEFTSH) PTP Peer Event Frame Transmitted Seconds High Register Offset */
#define GMAC_PEFRSH_REG_OFST           _UINT32_(0xF4)      /* (GMAC_PEFRSH) PTP Peer Event Frame Received Seconds High Register Offset */
#define GMAC_OTLO_REG_OFST             _UINT32_(0x100)     /* (GMAC_OTLO) Octets Transmitted Low Register Offset */
#define GMAC_OTHI_REG_OFST             _UINT32_(0x104)     /* (GMAC_OTHI) Octets Transmitted High Register Offset */
#define GMAC_FT_REG_OFST               _UINT32_(0x108)     /* (GMAC_FT) Frames Transmitted Register Offset */
#define GMAC_BCFT_REG_OFST             _UINT32_(0x10C)     /* (GMAC_BCFT) Broadcast Frames Transmitted Register Offset */
#define GMAC_MFT_REG_OFST              _UINT32_(0x110)     /* (GMAC_MFT) Multicast Frames Transmitted Register Offset */
#define GMAC_PFT_REG_OFST              _UINT32_(0x114)     /* (GMAC_PFT) Pause Frames Transmitted Register Offset */
#define GMAC_BFT64_REG_OFST            _UINT32_(0x118)     /* (GMAC_BFT64) 64 Byte Frames Transmitted Register Offset */
#define GMAC_TBFT127_REG_OFST          _UINT32_(0x11C)     /* (GMAC_TBFT127) 65 to 127 Byte Frames Transmitted Register Offset */
#define GMAC_TBFT255_REG_OFST          _UINT32_(0x120)     /* (GMAC_TBFT255) 128 to 255 Byte Frames Transmitted Register Offset */
#define GMAC_TBFT511_REG_OFST          _UINT32_(0x124)     /* (GMAC_TBFT511) 256 to 511 Byte Frames Transmitted Register Offset */
#define GMAC_TBFT1023_REG_OFST         _UINT32_(0x128)     /* (GMAC_TBFT1023) 512 to 1023 Byte Frames Transmitted Register Offset */
#define GMAC_TBFT1518_REG_OFST         _UINT32_(0x12C)     /* (GMAC_TBFT1518) 1024 to 1518 Byte Frames Transmitted Register Offset */
#define GMAC_GTBFT1518_REG_OFST        _UINT32_(0x130)     /* (GMAC_GTBFT1518) Greater Than 1518 Byte Frames Transmitted Register Offset */
#define GMAC_TUR_REG_OFST              _UINT32_(0x134)     /* (GMAC_TUR) Transmit Underruns Register Offset */
#define GMAC_SCF_REG_OFST              _UINT32_(0x138)     /* (GMAC_SCF) Single Collision Frames Register Offset */
#define GMAC_MCF_REG_OFST              _UINT32_(0x13C)     /* (GMAC_MCF) Multiple Collision Frames Register Offset */
#define GMAC_EC_REG_OFST               _UINT32_(0x140)     /* (GMAC_EC) Excessive Collisions Register Offset */
#define GMAC_LC_REG_OFST               _UINT32_(0x144)     /* (GMAC_LC) Late Collisions Register Offset */
#define GMAC_DTF_REG_OFST              _UINT32_(0x148)     /* (GMAC_DTF) Deferred Transmission Frames Register Offset */
#define GMAC_CSE_REG_OFST              _UINT32_(0x14C)     /* (GMAC_CSE) Carrier Sense Errors Register Offset */
#define GMAC_ORLO_REG_OFST             _UINT32_(0x150)     /* (GMAC_ORLO) Octets Received Low Received Register Offset */
#define GMAC_ORHI_REG_OFST             _UINT32_(0x154)     /* (GMAC_ORHI) Octets Received High Received Register Offset */
#define GMAC_FR_REG_OFST               _UINT32_(0x158)     /* (GMAC_FR) Frames Received Register Offset */
#define GMAC_BCFR_REG_OFST             _UINT32_(0x15C)     /* (GMAC_BCFR) Broadcast Frames Received Register Offset */
#define GMAC_MFR_REG_OFST              _UINT32_(0x160)     /* (GMAC_MFR) Multicast Frames Received Register Offset */
#define GMAC_PFR_REG_OFST              _UINT32_(0x164)     /* (GMAC_PFR) Pause Frames Received Register Offset */
#define GMAC_BFR64_REG_OFST            _UINT32_(0x168)     /* (GMAC_BFR64) 64 Byte Frames Received Register Offset */
#define GMAC_TBFR127_REG_OFST          _UINT32_(0x16C)     /* (GMAC_TBFR127) 65 to 127 Byte Frames Received Register Offset */
#define GMAC_TBFR255_REG_OFST          _UINT32_(0x170)     /* (GMAC_TBFR255) 128 to 255 Byte Frames Received Register Offset */
#define GMAC_TBFR511_REG_OFST          _UINT32_(0x174)     /* (GMAC_TBFR511) 256 to 511 Byte Frames Received Register Offset */
#define GMAC_TBFR1023_REG_OFST         _UINT32_(0x178)     /* (GMAC_TBFR1023) 512 to 1023 Byte Frames Received Register Offset */
#define GMAC_TBFR1518_REG_OFST         _UINT32_(0x17C)     /* (GMAC_TBFR1518) 1024 to 1518 Byte Frames Received Register Offset */
#define GMAC_TMXBFR_REG_OFST           _UINT32_(0x180)     /* (GMAC_TMXBFR) 1519 to Maximum Byte Frames Received Register Offset */
#define GMAC_UFR_REG_OFST              _UINT32_(0x184)     /* (GMAC_UFR) Undersize Frames Received Register Offset */
#define GMAC_OFR_REG_OFST              _UINT32_(0x188)     /* (GMAC_OFR) Oversize Frames Received Register Offset */
#define GMAC_JR_REG_OFST               _UINT32_(0x18C)     /* (GMAC_JR) Jabbers Received Register Offset */
#define GMAC_FCSE_REG_OFST             _UINT32_(0x190)     /* (GMAC_FCSE) Frame Check Sequence Errors Register Offset */
#define GMAC_LFFE_REG_OFST             _UINT32_(0x194)     /* (GMAC_LFFE) Length Field Frame Errors Register Offset */
#define GMAC_RSE_REG_OFST              _UINT32_(0x198)     /* (GMAC_RSE) Receive Symbol Errors Register Offset */
#define GMAC_AE_REG_OFST               _UINT32_(0x19C)     /* (GMAC_AE) Alignment Errors Register Offset */
#define GMAC_RRE_REG_OFST              _UINT32_(0x1A0)     /* (GMAC_RRE) Receive Resource Errors Register Offset */
#define GMAC_ROE_REG_OFST              _UINT32_(0x1A4)     /* (GMAC_ROE) Receive Overrun Register Offset */
#define GMAC_IHCE_REG_OFST             _UINT32_(0x1A8)     /* (GMAC_IHCE) IP Header Checksum Errors Register Offset */
#define GMAC_TCE_REG_OFST              _UINT32_(0x1AC)     /* (GMAC_TCE) TCP Checksum Errors Register Offset */
#define GMAC_UCE_REG_OFST              _UINT32_(0x1B0)     /* (GMAC_UCE) UDP Checksum Errors Register Offset */
#define GMAC_FLRXPCR_REG_OFST          _UINT32_(0x1B4)     /* (GMAC_FLRXPCR) Flushed Received Packets Counter Register Offset */
#define GMAC_TISUBN_REG_OFST           _UINT32_(0x1BC)     /* (GMAC_TISUBN) 1588 Timer Increment Sub-nanoseconds Register Offset */
#define GMAC_TSH_REG_OFST              _UINT32_(0x1C0)     /* (GMAC_TSH) 1588 Timer Seconds High Register Offset */
#define GMAC_TSL_REG_OFST              _UINT32_(0x1D0)     /* (GMAC_TSL) 1588 Timer Seconds Low Register Offset */
#define GMAC_TN_REG_OFST               _UINT32_(0x1D4)     /* (GMAC_TN) 1588 Timer Nanoseconds Register Offset */
#define GMAC_TA_REG_OFST               _UINT32_(0x1D8)     /* (GMAC_TA) 1588 Timer Adjust Register Offset */
#define GMAC_TI_REG_OFST               _UINT32_(0x1DC)     /* (GMAC_TI) 1588 Timer Increment Register Offset */
#define GMAC_EFTSL_REG_OFST            _UINT32_(0x1E0)     /* (GMAC_EFTSL) PTP Event Frame Transmitted Seconds Low Register Offset */
#define GMAC_EFTN_REG_OFST             _UINT32_(0x1E4)     /* (GMAC_EFTN) PTP Event Frame Transmitted Nanoseconds Register Offset */
#define GMAC_EFRSL_REG_OFST            _UINT32_(0x1E8)     /* (GMAC_EFRSL) PTP Event Frame Received Seconds Low Register Offset */
#define GMAC_EFRN_REG_OFST             _UINT32_(0x1EC)     /* (GMAC_EFRN) PTP Event Frame Received Nanoseconds Register Offset */
#define GMAC_PEFTSL_REG_OFST           _UINT32_(0x1F0)     /* (GMAC_PEFTSL) PTP Peer Event Frame Transmitted Seconds Low Register Offset */
#define GMAC_PEFTN_REG_OFST            _UINT32_(0x1F4)     /* (GMAC_PEFTN) PTP Peer Event Frame Transmitted Nanoseconds Register Offset */
#define GMAC_PEFRSL_REG_OFST           _UINT32_(0x1F8)     /* (GMAC_PEFRSL) PTP Peer Event Frame Received Seconds Low Register Offset */
#define GMAC_PEFRN_REG_OFST            _UINT32_(0x1FC)     /* (GMAC_PEFRN) PTP Peer Event Frame Received Nanoseconds Register Offset */
#define GMAC_RXLPI_REG_OFST            _UINT32_(0x270)     /* (GMAC_RXLPI) Received LPI Transitions Offset */
#define GMAC_RXLPITIME_REG_OFST        _UINT32_(0x274)     /* (GMAC_RXLPITIME) Received LPI Time Offset */
#define GMAC_TXLPI_REG_OFST            _UINT32_(0x278)     /* (GMAC_TXLPI) Transmit LPI Transitions Offset */
#define GMAC_TXLPITIME_REG_OFST        _UINT32_(0x27C)     /* (GMAC_TXLPITIME) Transmit LPI Time Offset */
#define GMAC_ISRPQ_REG_OFST            _UINT32_(0x400)     /* (GMAC_ISRPQ) Interrupt Status Register Priority Queue (index = 1) Offset */
#define GMAC_ISRPQ0_REG_OFST           _UINT32_(0x400)     /* (GMAC_ISRPQ0) Interrupt Status Register Priority Queue (index = 1) Offset */
#define GMAC_ISRPQ1_REG_OFST           _UINT32_(0x404)     /* (GMAC_ISRPQ1) Interrupt Status Register Priority Queue (index = 1) Offset */
#define GMAC_TBQBAPQ_REG_OFST          _UINT32_(0x440)     /* (GMAC_TBQBAPQ) Transmit Buffer Queue Base Address Register Priority Queue (index = 1) Offset */
#define GMAC_TBQBAPQ0_REG_OFST         _UINT32_(0x440)     /* (GMAC_TBQBAPQ0) Transmit Buffer Queue Base Address Register Priority Queue (index = 1) Offset */
#define GMAC_TBQBAPQ1_REG_OFST         _UINT32_(0x444)     /* (GMAC_TBQBAPQ1) Transmit Buffer Queue Base Address Register Priority Queue (index = 1) Offset */
#define GMAC_RBQBAPQ_REG_OFST          _UINT32_(0x480)     /* (GMAC_RBQBAPQ) Receive Buffer Queue Base Address Register Priority Queue (index = 1) Offset */
#define GMAC_RBQBAPQ0_REG_OFST         _UINT32_(0x480)     /* (GMAC_RBQBAPQ0) Receive Buffer Queue Base Address Register Priority Queue (index = 1) Offset */
#define GMAC_RBQBAPQ1_REG_OFST         _UINT32_(0x484)     /* (GMAC_RBQBAPQ1) Receive Buffer Queue Base Address Register Priority Queue (index = 1) Offset */
#define GMAC_RBSRPQ_REG_OFST           _UINT32_(0x4A0)     /* (GMAC_RBSRPQ) Receive Buffer Size Register Priority Queue (index = 1) Offset */
#define GMAC_RBSRPQ0_REG_OFST          _UINT32_(0x4A0)     /* (GMAC_RBSRPQ0) Receive Buffer Size Register Priority Queue (index = 1) Offset */
#define GMAC_RBSRPQ1_REG_OFST          _UINT32_(0x4A4)     /* (GMAC_RBSRPQ1) Receive Buffer Size Register Priority Queue (index = 1) Offset */
#define GMAC_CBSCR_REG_OFST            _UINT32_(0x4BC)     /* (GMAC_CBSCR) Credit-Based Shaping Control Register Offset */
#define GMAC_CBSISQA_REG_OFST          _UINT32_(0x4C0)     /* (GMAC_CBSISQA) Credit-Based Shaping IdleSlope Register for Queue A Offset */
#define GMAC_CBSISQB_REG_OFST          _UINT32_(0x4C4)     /* (GMAC_CBSISQB) Credit-Based Shaping IdleSlope Register for Queue B Offset */
#define GMAC_TQUBA_REG_OFST            _UINT32_(0x4C8)     /* (GMAC_TQUBA) 32 MSB Transmit Buffer Descriptor Queue Base Address Register Offset */
#define GMAC_TXBDCTRL_REG_OFST         _UINT32_(0x4CC)     /* (GMAC_TXBDCTRL) Transmit Buffer Data Control Register Offset */
#define GMAC_RXBDCTRL_REG_OFST         _UINT32_(0x4D0)     /* (GMAC_RXBDCTRL) Receive Buffer Data Control Register Offset */
#define GMAC_RQUBA_REG_OFST            _UINT32_(0x4D4)     /* (GMAC_RQUBA) 32 MSB Receive Buffer Descriptor Queue Base Address Register Offset */
#define GMAC_ST1RPQ_REG_OFST           _UINT32_(0x500)     /* (GMAC_ST1RPQ) Screening Type 1 Register Priority Queue (index = 0) Offset */
#define GMAC_ST2RPQ_REG_OFST           _UINT32_(0x540)     /* (GMAC_ST2RPQ) Screening Type 2 Register Priority Queue (index = 0) Offset */
#define GMAC_TSCTL_REG_OFST            _UINT32_(0x580)     /* (GMAC_TSCTL) Transmit Schedule Control Register Offset */
#define GMAC_TQBWRL0_REG_OFST          _UINT32_(0x590)     /* (GMAC_TQBWRL0) Transmit Queue Bandwidth Rate Limit 0 Register Offset */
#define GMAC_TQSA_REG_OFST             _UINT32_(0x5A0)     /* (GMAC_TQSA) Transmit Queue Segment Allocation Register Offset */
#define GMAC_IERPQ_REG_OFST            _UINT32_(0x600)     /* (GMAC_IERPQ) Interrupt Enable Register Priority Queue (index = 1) Offset */
#define GMAC_IERPQ0_REG_OFST           _UINT32_(0x600)     /* (GMAC_IERPQ0) Interrupt Enable Register Priority Queue (index = 1) Offset */
#define GMAC_IERPQ1_REG_OFST           _UINT32_(0x604)     /* (GMAC_IERPQ1) Interrupt Enable Register Priority Queue (index = 1) Offset */
#define GMAC_IDRPQ_REG_OFST            _UINT32_(0x620)     /* (GMAC_IDRPQ) Interrupt Disable Register Priority Queue (index = 1) Offset */
#define GMAC_IDRPQ0_REG_OFST           _UINT32_(0x620)     /* (GMAC_IDRPQ0) Interrupt Disable Register Priority Queue (index = 1) Offset */
#define GMAC_IDRPQ1_REG_OFST           _UINT32_(0x624)     /* (GMAC_IDRPQ1) Interrupt Disable Register Priority Queue (index = 1) Offset */
#define GMAC_IMRPQ_REG_OFST            _UINT32_(0x640)     /* (GMAC_IMRPQ) Interrupt Mask Register Priority Queue (index = 1) Offset */
#define GMAC_IMRPQ0_REG_OFST           _UINT32_(0x640)     /* (GMAC_IMRPQ0) Interrupt Mask Register Priority Queue (index = 1) Offset */
#define GMAC_IMRPQ1_REG_OFST           _UINT32_(0x644)     /* (GMAC_IMRPQ1) Interrupt Mask Register Priority Queue (index = 1) Offset */
#define GMAC_ST2ER_REG_OFST            _UINT32_(0x6E0)     /* (GMAC_ST2ER) Screening Type 2 Ethertype Register (index = 0) Offset */

